
newton_rapson.out:     file format elf32-littleriscv

Contents of the .eh_frame section:

00000000 00000010 00000000 CIE
  Version:               3
  Augmentation:          "zR"
  Code alignment factor: 1
  Data alignment factor: -4
  Return address column: 1
  Augmentation data:     1b

  DW_CFA_def_cfa: r2 ofs 0

00000014 00000080 00000018 FDE cie=00000000 pc=08007e84..080084bc
  DW_CFA_advance_loc4: 4 to 08007e88
  DW_CFA_def_cfa_offset: 48
  DW_CFA_advance_loc4: 44 to 08007eb4
  DW_CFA_offset: r8 at cfa-8
  DW_CFA_offset: r20 at cfa-24
  DW_CFA_offset: r1 at cfa-4
  DW_CFA_offset: r9 at cfa-12
  DW_CFA_offset: r18 at cfa-16
  DW_CFA_offset: r19 at cfa-20
  DW_CFA_offset: r21 at cfa-28
  DW_CFA_offset: r22 at cfa-32
  DW_CFA_offset: r23 at cfa-36
  DW_CFA_offset: r24 at cfa-40
  DW_CFA_offset: r25 at cfa-44
  DW_CFA_advance_loc4: 676 to 08008158
  DW_CFA_remember_state
  DW_CFA_restore: r1
  DW_CFA_advance_loc4: 4 to 0800815c
  DW_CFA_restore: r8
  DW_CFA_advance_loc4: 4 to 08008160
  DW_CFA_restore: r9
  DW_CFA_advance_loc4: 4 to 08008164
  DW_CFA_restore: r18
  DW_CFA_advance_loc4: 4 to 08008168
  DW_CFA_restore: r19
  DW_CFA_advance_loc4: 4 to 0800816c
  DW_CFA_restore: r20
  DW_CFA_advance_loc4: 4 to 08008170
  DW_CFA_restore: r21
  DW_CFA_advance_loc4: 4 to 08008174
  DW_CFA_restore: r22
  DW_CFA_advance_loc4: 4 to 08008178
  DW_CFA_restore: r23
  DW_CFA_advance_loc4: 4 to 0800817c
  DW_CFA_restore: r24
  DW_CFA_advance_loc4: 4 to 08008180
  DW_CFA_restore: r25

    <18>   DW_AT_name        : (indirect string, offset: 0x0): init.S
    <1c>   DW_AT_comp_dir    : (indirect string, offset: 0x7): /home/billtsou/Desktop/UPP/sunflower-simulator/benchmarks/source/riscv_newton-raphson-orig
    <20>   DW_AT_producer    : (indirect string, offset: 0x62): GNU AS 2.29.1
    <24>   DW_AT_language    : 32769	(MIPS assembler)
  Compilation Unit @ offset 0x26:
   Length:        0xa6e (32-bit)
   Version:       4
   Abbrev Offset: 0x14
   Pointer Size:  4
 <0><31>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <32>   DW_AT_producer    : (indirect string, offset: 0xff): GNU C17 8.2.0 -march=rv32ifd -mabi=ilp32d -g -O0
    <36>   DW_AT_language    : 12	(ANSI C99)
    <37>   DW_AT_name        : (indirect string, offset: 0x173): newton_rapson.c
    <3b>   DW_AT_comp_dir    : (indirect string, offset: 0x7): /home/billtsou/Desktop/UPP/sunflower-simulator/benchmarks/source/riscv_newton-raphson-orig
    <3f>   DW_AT_low_pc      : 0x800401c
    <43>   DW_AT_high_pc     : 0x180
    <47>   DW_AT_stmt_list   : 0x41
 <1><4b>: Abbrev Number: 2 (DW_TAG_base_type)
    <4c>   DW_AT_byte_size   : 1
    <4d>   DW_AT_encoding    : 6	(signed char)
    <4e>   DW_AT_name        : (indirect string, offset: 0x348): signed char
 <1><52>: Abbrev Number: 2 (DW_TAG_base_type)
    <53>   DW_AT_byte_size   : 1
    <54>   DW_AT_encoding    : 8	(unsigned char)
    <55>   DW_AT_name        : (indirect string, offset: 0x346): unsigned char
 <1><59>: Abbrev Number: 2 (DW_TAG_base_type)
    <5a>   DW_AT_byte_size   : 2
    <5b>   DW_AT_encoding    : 5	(signed)
    <5c>   DW_AT_name        : (indirect string, offset: 0x35d): short int
 <1><60>: Abbrev Number: 2 (DW_TAG_base_type)
    <61>   DW_AT_byte_size   : 2
    <62>   DW_AT_encoding    : 7	(unsigned)
    <63>   DW_AT_name        : (indirect string, offset: 0x291): short unsigned int
 <1><67>: Abbrev Number: 2 (DW_TAG_base_type)
    <68>   DW_AT_byte_size   : 4
    <69>   DW_AT_encoding    : 5	(signed)
    <6a>   DW_AT_name        : (indirect string, offset: 0x16a): long int
 <1><6e>: Abbrev Number: 2 (DW_TAG_base_type)
    <6f>   DW_AT_byte_size   : 4
    <70>   DW_AT_encoding    : 7	(unsigned)
    <71>   DW_AT_name        : (indirect string, offset: 0xc5): long unsigned int
 <1><75>: Abbrev Number: 2 (DW_TAG_base_type)
    <76>   DW_AT_byte_size   : 8
    <77>   DW_AT_encoding    : 5	(signed)
    <78>   DW_AT_name        : (indirect string, offset: 0x165): long long int
 <1><7c>: Abbrev Number: 2 (DW_TAG_base_type)
    <7d>   DW_AT_byte_size   : 8
    <7e>   DW_AT_encoding    : 7	(unsigned)
    <7f>   DW_AT_name        : (indirect string, offset: 0xc0): long long unsigned int
 <1><83>: Abbrev Number: 3 (DW_TAG_base_type)
    <84>   DW_AT_byte_size   : 4
    <85>   DW_AT_encoding    : 5	(signed)
    <86>   DW_AT_name        : int
 <1><8a>: Abbrev Number: 2 (DW_TAG_base_type)
    <8b>   DW_AT_byte_size   : 4
    <8c>   DW_AT_encoding    : 7	(unsigned)
    <8d>   DW_AT_name        : (indirect string, offset: 0xca): unsigned int
 <1><91>: Abbrev Number: 2 (DW_TAG_base_type)
    <92>   DW_AT_byte_size   : 16
    <93>   DW_AT_encoding    : 4	(float)
    <94>   DW_AT_name        : (indirect string, offset: 0x1261): long double
 <1><98>: Abbrev Number: 4 (DW_TAG_typedef)
    <99>   DW_AT_name        : (indirect string, offset: 0x334): _LOCK_RECURSIVE_T
    <9d>   DW_AT_decl_file   : 2
    <9e>   DW_AT_decl_line   : 12
    <9f>   DW_AT_decl_column : 13
    <a0>   DW_AT_type        : <0x83>
 <1><a4>: Abbrev Number: 4 (DW_TAG_typedef)
    <a5>   DW_AT_name        : (indirect string, offset: 0x1127): _off_t
    <a9>   DW_AT_decl_file   : 3
    <aa>   DW_AT_decl_line   : 44
    <ab>   DW_AT_decl_column : 14
    <ac>   DW_AT_type        : <0x67>
 <1><b0>: Abbrev Number: 4 (DW_TAG_typedef)
    <b1>   DW_AT_name        : (indirect string, offset: 0x40b): _fpos_t
    <b5>   DW_AT_decl_file   : 3
    <b6>   DW_AT_decl_line   : 114
    <b7>   DW_AT_decl_column : 14
    <b8>   DW_AT_type        : <0x67>
 <1><bc>: Abbrev Number: 4 (DW_TAG_typedef)
    <bd>   DW_AT_name        : (indirect string, offset: 0x4be): _ssize_t
    <c1>   DW_AT_decl_file   : 3
    <c2>   DW_AT_decl_line   : 145
    <c3>   DW_AT_decl_column : 23
    <c4>   DW_AT_type        : <0x83>
 <1><c8>: Abbrev Number: 5 (DW_TAG_typedef)
    <c9>   DW_AT_name        : (indirect string, offset: 0x2d4): wint_t
    <cd>   DW_AT_decl_file   : 4
    <ce>   DW_AT_decl_line   : 357
    <d0>   DW_AT_decl_column : 23
    <d1>   DW_AT_type        : <0x8a>
 <1><d5>: Abbrev Number: 6 (DW_TAG_union_type)
    <d6>   DW_AT_byte_size   : 4
    <d7>   DW_AT_decl_file   : 3
    <d8>   DW_AT_decl_line   : 166
    <d9>   DW_AT_decl_column : 3
    <da>   DW_AT_sibling     : <0xf7>
 <2><de>: Abbrev Number: 7 (DW_TAG_member)
    <df>   DW_AT_name        : (indirect string, offset: 0x2ce): __wch
    <e3>   DW_AT_decl_file   : 3
    <e4>   DW_AT_decl_line   : 168
    <e5>   DW_AT_decl_column : 12
    <e6>   DW_AT_type        : <0xc8>
 <2><ea>: Abbrev Number: 7 (DW_TAG_member)
    <eb>   DW_AT_name        : (indirect string, offset: 0x26d): __wchb
    <ef>   DW_AT_decl_file   : 3
    <f0>   DW_AT_decl_line   : 169
    <f1>   DW_AT_decl_column : 19
    <f2>   DW_AT_type        : <0xf7>
 <2><f6>: Abbrev Number: 0
 <1><f7>: Abbrev Number: 8 (DW_TAG_array_type)
    <f8>   DW_AT_type        : <0x52>
    <fc>   DW_AT_sibling     : <0x107>
 <2><100>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <101>   DW_AT_type        : <0x8a>
    <105>   DW_AT_upper_bound : 3
 <2><106>: Abbrev Number: 0
 <1><107>: Abbrev Number: 10 (DW_TAG_structure_type)
    <108>   DW_AT_byte_size   : 8
    <109>   DW_AT_decl_file   : 3
    <10a>   DW_AT_decl_line   : 163
    <10b>   DW_AT_decl_column : 9
    <10c>   DW_AT_sibling     : <0x12b>
 <2><110>: Abbrev Number: 11 (DW_TAG_member)
    <111>   DW_AT_name        : (indirect string, offset: 0x3f5): __count
    <115>   DW_AT_decl_file   : 3
    <116>   DW_AT_decl_line   : 165
    <117>   DW_AT_decl_column : 7
    <118>   DW_AT_type        : <0x83>
    <11c>   DW_AT_data_member_location: 0
 <2><11d>: Abbrev Number: 11 (DW_TAG_member)
    <11e>   DW_AT_name        : (indirect string, offset: 0x3fd): __value
    <122>   DW_AT_decl_file   : 3
    <123>   DW_AT_decl_line   : 170
    <124>   DW_AT_decl_column : 5
    <125>   DW_AT_type        : <0xd5>
    <129>   DW_AT_data_member_location: 4
 <2><12a>: Abbrev Number: 0
 <1><12b>: Abbrev Number: 4 (DW_TAG_typedef)
    <12c>   DW_AT_name        : (indirect string, offset: 0x37e): _mbstate_t
    <130>   DW_AT_decl_file   : 3
    <131>   DW_AT_decl_line   : 171
    <132>   DW_AT_decl_column : 3
    <133>   DW_AT_type        : <0x107>
 <1><137>: Abbrev Number: 4 (DW_TAG_typedef)
    <138>   DW_AT_name        : (indirect string, offset: 0x22a): _flock_t
    <13c>   DW_AT_decl_file   : 3
    <13d>   DW_AT_decl_line   : 175
    <13e>   DW_AT_decl_column : 27
    <13f>   DW_AT_type        : <0x98>
 <1><143>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <144>   DW_AT_byte_size   : 4
 <1><145>: Abbrev Number: 4 (DW_TAG_typedef)
    <146>   DW_AT_name        : (indirect string, offset: 0x444): __ULong
    <14a>   DW_AT_decl_file   : 5
    <14b>   DW_AT_decl_line   : 22
    <14c>   DW_AT_decl_column : 25
    <14d>   DW_AT_type        : <0x6e>
 <1><151>: Abbrev Number: 13 (DW_TAG_structure_type)
    <152>   DW_AT_name        : (indirect string, offset: 0x23b): _Bigint
    <156>   DW_AT_byte_size   : 24
    <157>   DW_AT_decl_file   : 5
    <158>   DW_AT_decl_line   : 47
    <159>   DW_AT_decl_column : 8
    <15a>   DW_AT_sibling     : <0x1ab>
 <2><15e>: Abbrev Number: 11 (DW_TAG_member)
    <15f>   DW_AT_name        : (indirect string, offset: 0x39f): _next
    <163>   DW_AT_decl_file   : 5
    <164>   DW_AT_decl_line   : 49
    <165>   DW_AT_decl_column : 19
    <166>   DW_AT_type        : <0x1ab>
    <16a>   DW_AT_data_member_location: 0
 <2><16b>: Abbrev Number: 14 (DW_TAG_member)
    <16c>   DW_AT_name        : _k
    <16f>   DW_AT_decl_file   : 5
    <170>   DW_AT_decl_line   : 50
    <171>   DW_AT_decl_column : 7
    <172>   DW_AT_type        : <0x83>
    <176>   DW_AT_data_member_location: 4
 <2><177>: Abbrev Number: 11 (DW_TAG_member)
    <178>   DW_AT_name        : (indirect string, offset: 0x3e7): _maxwds
    <17c>   DW_AT_decl_file   : 5
    <17d>   DW_AT_decl_line   : 50
    <17e>   DW_AT_decl_column : 11
    <17f>   DW_AT_type        : <0x83>
    <183>   DW_AT_data_member_location: 8
 <2><184>: Abbrev Number: 11 (DW_TAG_member)
    <185>   DW_AT_name        : (indirect string, offset: 0x224): _sign
    <189>   DW_AT_decl_file   : 5
    <18a>   DW_AT_decl_line   : 50
    <18b>   DW_AT_decl_column : 20
    <18c>   DW_AT_type        : <0x83>
    <190>   DW_AT_data_member_location: 12
 <2><191>: Abbrev Number: 11 (DW_TAG_member)
    <192>   DW_AT_name        : (indirect string, offset: 0x498): _wds
    <196>   DW_AT_decl_file   : 5
    <197>   DW_AT_decl_line   : 50
    <198>   DW_AT_decl_column : 27
    <199>   DW_AT_type        : <0x83>
    <19d>   DW_AT_data_member_location: 16
 <2><19e>: Abbrev Number: 14 (DW_TAG_member)
    <19f>   DW_AT_name        : _x
    <1a2>   DW_AT_decl_file   : 5
    <1a3>   DW_AT_decl_line   : 51
    <1a4>   DW_AT_decl_column : 11
    <1a5>   DW_AT_type        : <0x1b1>
    <1a9>   DW_AT_data_member_location: 20
 <2><1aa>: Abbrev Number: 0
 <1><1ab>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <1ac>   DW_AT_byte_size   : 4
    <1ad>   DW_AT_type        : <0x151>
 <1><1b1>: Abbrev Number: 8 (DW_TAG_array_type)
    <1b2>   DW_AT_type        : <0x145>
    <1b6>   DW_AT_sibling     : <0x1c1>
 <2><1ba>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <1bb>   DW_AT_type        : <0x8a>
    <1bf>   DW_AT_upper_bound : 0
 <2><1c0>: Abbrev Number: 0
 <1><1c1>: Abbrev Number: 13 (DW_TAG_structure_type)
    <1c2>   DW_AT_name        : (indirect string, offset: 0x262): __tm
    <1c6>   DW_AT_byte_size   : 36
    <1c7>   DW_AT_decl_file   : 5
    <1c8>   DW_AT_decl_line   : 55
    <1c9>   DW_AT_decl_column : 8
    <1ca>   DW_AT_sibling     : <0x244>
 <2><1ce>: Abbrev Number: 11 (DW_TAG_member)
    <1cf>   DW_AT_name        : (indirect string, offset: 0x15c): __tm_sec
    <1d3>   DW_AT_decl_file   : 5
    <1d4>   DW_AT_decl_line   : 57
    <1d5>   DW_AT_decl_column : 9
    <1d6>   DW_AT_type        : <0x83>
    <1da>   DW_AT_data_member_location: 0
 <2><1db>: Abbrev Number: 11 (DW_TAG_member)
    <1dc>   DW_AT_name        : (indirect string, offset: 0x413): __tm_min
    <1e0>   DW_AT_decl_file   : 5
    <1e1>   DW_AT_decl_line   : 58
    <1e2>   DW_AT_decl_column : 9
    <1e3>   DW_AT_type        : <0x83>
    <1e7>   DW_AT_data_member_location: 4
 <2><1e8>: Abbrev Number: 11 (DW_TAG_member)
    <1e9>   DW_AT_name        : (indirect string, offset: 0x189): __tm_hour
    <1ed>   DW_AT_decl_file   : 5
    <1ee>   DW_AT_decl_line   : 59
    <1ef>   DW_AT_decl_column : 9
    <1f0>   DW_AT_type        : <0x83>
    <1f4>   DW_AT_data_member_location: 8
 <2><1f5>: Abbrev Number: 11 (DW_TAG_member)
    <1f6>   DW_AT_name        : (indirect string, offset: 0x52e): __tm_mday
    <1fa>   DW_AT_decl_file   : 5
    <1fb>   DW_AT_decl_line   : 60
    <1fc>   DW_AT_decl_column : 9
    <1fd>   DW_AT_type        : <0x83>
    <201>   DW_AT_data_member_location: 12
 <2><202>: Abbrev Number: 11 (DW_TAG_member)
    <203>   DW_AT_name        : (indirect string, offset: 0x304): __tm_mon
    <207>   DW_AT_decl_file   : 5
    <208>   DW_AT_decl_line   : 61
    <209>   DW_AT_decl_column : 9
    <20a>   DW_AT_type        : <0x83>
    <20e>   DW_AT_data_member_location: 16
 <2><20f>: Abbrev Number: 11 (DW_TAG_member)
    <210>   DW_AT_name        : (indirect string, offset: 0x2ea): __tm_year
    <214>   DW_AT_decl_file   : 5
    <215>   DW_AT_decl_line   : 62
    <216>   DW_AT_decl_column : 9
    <217>   DW_AT_type        : <0x83>
    <21b>   DW_AT_data_member_location: 20
 <2><21c>: Abbrev Number: 11 (DW_TAG_member)
    <21d>   DW_AT_name        : (indirect string, offset: 0x49d): __tm_wday
    <221>   DW_AT_decl_file   : 5
    <222>   DW_AT_decl_line   : 63
    <223>   DW_AT_decl_column : 9
    <224>   DW_AT_type        : <0x83>
    <228>   DW_AT_data_member_location: 24
 <2><229>: Abbrev Number: 11 (DW_TAG_member)
    <22a>   DW_AT_name        : (indirect string, offset: 0x367): __tm_yday
    <22e>   DW_AT_decl_file   : 5
    <22f>   DW_AT_decl_line   : 64
    <230>   DW_AT_decl_column : 9
    <231>   DW_AT_type        : <0x83>
    <235>   DW_AT_data_member_location: 28
 <2><236>: Abbrev Number: 11 (DW_TAG_member)
    <237>   DW_AT_name        : (indirect string, offset: 0x4e9): __tm_isdst
    <23b>   DW_AT_decl_file   : 5
    <23c>   DW_AT_decl_line   : 65
    <23d>   DW_AT_decl_column : 9
    <23e>   DW_AT_type        : <0x83>
    <242>   DW_AT_data_member_location: 32
 <2><243>: Abbrev Number: 0
 <1><244>: Abbrev Number: 16 (DW_TAG_structure_type)
    <245>   DW_AT_name        : (indirect string, offset: 0x198): _on_exit_args
    <249>   DW_AT_byte_size   : 264
    <24b>   DW_AT_decl_file   : 5
    <24c>   DW_AT_decl_line   : 74
    <24d>   DW_AT_decl_column : 8
    <24e>   DW_AT_sibling     : <0x289>
 <2><252>: Abbrev Number: 11 (DW_TAG_member)
    <253>   DW_AT_name        : (indirect string, offset: 0x217): _fnargs
    <257>   DW_AT_decl_file   : 5
    <258>   DW_AT_decl_line   : 75
    <259>   DW_AT_decl_column : 10
    <25a>   DW_AT_type        : <0x289>
    <25e>   DW_AT_data_member_location: 0
 <2><25f>: Abbrev Number: 11 (DW_TAG_member)
    <260>   DW_AT_name        : (indirect string, offset: 0x70): _dso_handle
    <264>   DW_AT_decl_file   : 5
    <265>   DW_AT_decl_line   : 76
    <266>   DW_AT_decl_column : 9
    <267>   DW_AT_type        : <0x289>
    <26b>   DW_AT_data_member_location: 128
 <2><26c>: Abbrev Number: 17 (DW_TAG_member)
    <26d>   DW_AT_name        : (indirect string, offset: 0x436): _fntypes
    <271>   DW_AT_decl_file   : 5
    <272>   DW_AT_decl_line   : 78
    <273>   DW_AT_decl_column : 10
    <274>   DW_AT_type        : <0x145>
    <278>   DW_AT_data_member_location: 256
 <2><27a>: Abbrev Number: 17 (DW_TAG_member)
    <27b>   DW_AT_name        : (indirect string, offset: 0x1bd): _is_cxa
    <27f>   DW_AT_decl_file   : 5
    <280>   DW_AT_decl_line   : 81
    <281>   DW_AT_decl_column : 10
    <282>   DW_AT_type        : <0x145>
    <286>   DW_AT_data_member_location: 260
 <2><288>: Abbrev Number: 0
 <1><289>: Abbrev Number: 8 (DW_TAG_array_type)
    <28a>   DW_AT_type        : <0x143>
    <28e>   DW_AT_sibling     : <0x299>
 <2><292>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <293>   DW_AT_type        : <0x8a>
    <297>   DW_AT_upper_bound : 31
 <2><298>: Abbrev Number: 0
 <1><299>: Abbrev Number: 16 (DW_TAG_structure_type)
    <29a>   DW_AT_name        : (indirect string, offset: 0x30d): _atexit
    <29e>   DW_AT_byte_size   : 400
    <2a0>   DW_AT_decl_file   : 5
    <2a1>   DW_AT_decl_line   : 93
    <2a2>   DW_AT_decl_column : 8
    <2a3>   DW_AT_sibling     : <0x2dc>
 <2><2a7>: Abbrev Number: 11 (DW_TAG_member)
    <2a8>   DW_AT_name        : (indirect string, offset: 0x39f): _next
    <2ac>   DW_AT_decl_file   : 5
    <2ad>   DW_AT_decl_line   : 94
    <2ae>   DW_AT_decl_column : 18
    <2af>   DW_AT_type        : <0x2dc>
    <2b3>   DW_AT_data_member_location: 0
 <2><2b4>: Abbrev Number: 11 (DW_TAG_member)
    <2b5>   DW_AT_name        : (indirect string, offset: 0x3b7): _ind
    <2b9>   DW_AT_decl_file   : 5
    <2ba>   DW_AT_decl_line   : 95
    <2bb>   DW_AT_decl_column : 6
    <2bc>   DW_AT_type        : <0x83>
    <2c0>   DW_AT_data_member_location: 4
 <2><2c1>: Abbrev Number: 11 (DW_TAG_member)
    <2c2>   DW_AT_name        : (indirect string, offset: 0x21f): _fns
    <2c6>   DW_AT_decl_file   : 5
    <2c7>   DW_AT_decl_line   : 97
    <2c8>   DW_AT_decl_column : 9
    <2c9>   DW_AT_type        : <0x2e2>
    <2cd>   DW_AT_data_member_location: 8
 <2><2ce>: Abbrev Number: 11 (DW_TAG_member)
    <2cf>   DW_AT_name        : (indirect string, offset: 0x198): _on_exit_args
    <2d3>   DW_AT_decl_file   : 5
    <2d4>   DW_AT_decl_line   : 98
    <2d5>   DW_AT_decl_column : 30
    <2d6>   DW_AT_type        : <0x244>
    <2da>   DW_AT_data_member_location: 136
 <2><2db>: Abbrev Number: 0
 <1><2dc>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <2dd>   DW_AT_byte_size   : 4
    <2de>   DW_AT_type        : <0x299>
 <1><2e2>: Abbrev Number: 8 (DW_TAG_array_type)
    <2e3>   DW_AT_type        : <0x2f2>
    <2e7>   DW_AT_sibling     : <0x2f2>
 <2><2eb>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <2ec>   DW_AT_type        : <0x8a>
    <2f0>   DW_AT_upper_bound : 31
 <2><2f1>: Abbrev Number: 0
 <1><2f2>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <2f3>   DW_AT_byte_size   : 4
    <2f4>   DW_AT_type        : <0x2f8>
 <1><2f8>: Abbrev Number: 18 (DW_TAG_subroutine_type)
    <2f9>   DW_AT_prototyped  : 1
 <1><2f9>: Abbrev Number: 13 (DW_TAG_structure_type)
    <2fa>   DW_AT_name        : (indirect string, offset: 0x527): __sbuf
    <2fe>   DW_AT_byte_size   : 8
    <2ff>   DW_AT_decl_file   : 5
    <300>   DW_AT_decl_line   : 117
    <301>   DW_AT_decl_column : 8
    <302>   DW_AT_sibling     : <0x321>
 <2><306>: Abbrev Number: 11 (DW_TAG_member)
    <307>   DW_AT_name        : (indirect string, offset: 0xcdc): _base
    <30b>   DW_AT_decl_file   : 5
    <30c>   DW_AT_decl_line   : 118
    <30d>   DW_AT_decl_column : 17
    <30e>   DW_AT_type        : <0x321>
    <312>   DW_AT_data_member_location: 0
 <2><313>: Abbrev Number: 11 (DW_TAG_member)
    <314>   DW_AT_name        : (indirect string, offset: 0xd38): _size
    <318>   DW_AT_decl_file   : 5
    <319>   DW_AT_decl_line   : 119
    <31a>   DW_AT_decl_column : 6
    <31b>   DW_AT_type        : <0x83>
    <31f>   DW_AT_data_member_location: 4
 <2><320>: Abbrev Number: 0
 <1><321>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <322>   DW_AT_byte_size   : 4
    <323>   DW_AT_type        : <0x52>
 <1><327>: Abbrev Number: 13 (DW_TAG_structure_type)
    <328>   DW_AT_name        : (indirect string, offset: 0x389): __sFILE
    <32c>   DW_AT_byte_size   : 104
    <32d>   DW_AT_decl_file   : 5
    <32e>   DW_AT_decl_line   : 181
    <32f>   DW_AT_decl_column : 8
    <330>   DW_AT_sibling     : <0x46a>
 <2><334>: Abbrev Number: 14 (DW_TAG_member)
    <335>   DW_AT_name        : _p
    <338>   DW_AT_decl_file   : 5
    <339>   DW_AT_decl_line   : 182
    <33a>   DW_AT_decl_column : 18
    <33b>   DW_AT_type        : <0x321>
    <33f>   DW_AT_data_member_location: 0
 <2><340>: Abbrev Number: 14 (DW_TAG_member)
    <341>   DW_AT_name        : _r
    <344>   DW_AT_decl_file   : 5
    <345>   DW_AT_decl_line   : 183
    <346>   DW_AT_decl_column : 7
    <347>   DW_AT_type        : <0x83>
    <34b>   DW_AT_data_member_location: 4
 <2><34c>: Abbrev Number: 14 (DW_TAG_member)
    <34d>   DW_AT_name        : _w
    <350>   DW_AT_decl_file   : 5
    <351>   DW_AT_decl_line   : 184
    <352>   DW_AT_decl_column : 7
    <353>   DW_AT_type        : <0x83>
    <357>   DW_AT_data_member_location: 8
 <2><358>: Abbrev Number: 11 (DW_TAG_member)
    <359>   DW_AT_name        : (indirect string, offset: 0x1b6): _flags
    <35d>   DW_AT_decl_file   : 5
    <35e>   DW_AT_decl_line   : 185
    <35f>   DW_AT_decl_column : 9
    <360>   DW_AT_type        : <0x59>
    <364>   DW_AT_data_member_location: 12
 <2><365>: Abbrev Number: 11 (DW_TAG_member)
    <366>   DW_AT_name        : (indirect string, offset: 0x284): _file
    <36a>   DW_AT_decl_file   : 5
    <36b>   DW_AT_decl_line   : 186
    <36c>   DW_AT_decl_column : 9
    <36d>   DW_AT_type        : <0x59>
    <371>   DW_AT_data_member_location: 14
 <2><372>: Abbrev Number: 14 (DW_TAG_member)
    <373>   DW_AT_name        : _bf
    <377>   DW_AT_decl_file   : 5
    <378>   DW_AT_decl_line   : 187
    <379>   DW_AT_decl_column : 17
    <37a>   DW_AT_type        : <0x2f9>
    <37e>   DW_AT_data_member_location: 16
 <2><37f>: Abbrev Number: 11 (DW_TAG_member)
    <380>   DW_AT_name        : (indirect string, offset: 0xe6): _lbfsize
    <384>   DW_AT_decl_file   : 5
    <385>   DW_AT_decl_line   : 188
    <386>   DW_AT_decl_column : 7
    <387>   DW_AT_type        : <0x83>
    <38b>   DW_AT_data_member_location: 24
 <2><38c>: Abbrev Number: 11 (DW_TAG_member)
    <38d>   DW_AT_name        : (indirect string, offset: 0x1a6): _cookie
    <391>   DW_AT_decl_file   : 5
    <392>   DW_AT_decl_line   : 195
    <393>   DW_AT_decl_column : 8
    <394>   DW_AT_type        : <0x143>
    <398>   DW_AT_data_member_location: 28
 <2><399>: Abbrev Number: 11 (DW_TAG_member)
    <39a>   DW_AT_name        : (indirect string, offset: 0x252): _read
    <39e>   DW_AT_decl_file   : 5
    <39f>   DW_AT_decl_line   : 197
    <3a0>   DW_AT_decl_column : 27
    <3a1>   DW_AT_type        : <0x5ee>
    <3a5>   DW_AT_data_member_location: 32
 <2><3a6>: Abbrev Number: 11 (DW_TAG_member)
    <3a7>   DW_AT_name        : (indirect string, offset: 0x2e3): _write
    <3ab>   DW_AT_decl_file   : 5
    <3ac>   DW_AT_decl_line   : 199
    <3ad>   DW_AT_decl_column : 27
    <3ae>   DW_AT_type        : <0x618>
    <3b2>   DW_AT_data_member_location: 36
 <2><3b3>: Abbrev Number: 11 (DW_TAG_member)
    <3b4>   DW_AT_name        : (indirect string, offset: 0x405): _seek
    <3b8>   DW_AT_decl_file   : 5
    <3b9>   DW_AT_decl_line   : 202
    <3ba>   DW_AT_decl_column : 11
    <3bb>   DW_AT_type        : <0x63c>
    <3bf>   DW_AT_data_member_location: 40
 <2><3c0>: Abbrev Number: 11 (DW_TAG_member)
    <3c1>   DW_AT_name        : (indirect string, offset: 0x503): _close
    <3c5>   DW_AT_decl_file   : 5
    <3c6>   DW_AT_decl_line   : 203
    <3c7>   DW_AT_decl_column : 7
    <3c8>   DW_AT_type        : <0x656>
    <3cc>   DW_AT_data_member_location: 44
 <2><3cd>: Abbrev Number: 14 (DW_TAG_member)
    <3ce>   DW_AT_name        : _ub
    <3d2>   DW_AT_decl_file   : 5
    <3d3>   DW_AT_decl_line   : 206
    <3d4>   DW_AT_decl_column : 17
    <3d5>   DW_AT_type        : <0x2f9>
    <3d9>   DW_AT_data_member_location: 48
 <2><3da>: Abbrev Number: 14 (DW_TAG_member)
    <3db>   DW_AT_name        : _up
    <3df>   DW_AT_decl_file   : 5
    <3e0>   DW_AT_decl_line   : 207
    <3e1>   DW_AT_decl_column : 18
    <3e2>   DW_AT_type        : <0x321>
    <3e6>   DW_AT_data_member_location: 56
 <2><3e7>: Abbrev Number: 14 (DW_TAG_member)
    <3e8>   DW_AT_name        : _ur
    <3ec>   DW_AT_decl_file   : 5
    <3ed>   DW_AT_decl_line   : 208
    <3ee>   DW_AT_decl_column : 7
    <3ef>   DW_AT_type        : <0x83>
    <3f3>   DW_AT_data_member_location: 60
 <2><3f4>: Abbrev Number: 11 (DW_TAG_member)
    <3f5>   DW_AT_name        : (indirect string, offset: 0x183): _ubuf
    <3f9>   DW_AT_decl_file   : 5
    <3fa>   DW_AT_decl_line   : 211
    <3fb>   DW_AT_decl_column : 17
    <3fc>   DW_AT_type        : <0x65c>
    <400>   DW_AT_data_member_location: 64
 <2><401>: Abbrev Number: 11 (DW_TAG_member)
    <402>   DW_AT_name        : (indirect string, offset: 0x4db): _nbuf
    <406>   DW_AT_decl_file   : 5
    <407>   DW_AT_decl_line   : 212
    <408>   DW_AT_decl_column : 17
    <409>   DW_AT_type        : <0x66c>
    <40d>   DW_AT_data_member_location: 67
 <2><40e>: Abbrev Number: 14 (DW_TAG_member)
    <40f>   DW_AT_name        : _lb
    <413>   DW_AT_decl_file   : 5
    <414>   DW_AT_decl_line   : 215
    <415>   DW_AT_decl_column : 17
    <416>   DW_AT_type        : <0x2f9>
    <41a>   DW_AT_data_member_location: 68
 <2><41b>: Abbrev Number: 11 (DW_TAG_member)
    <41c>   DW_AT_name        : (indirect string, offset: 0xe44): _blksize
    <420>   DW_AT_decl_file   : 5
    <421>   DW_AT_decl_line   : 218
    <422>   DW_AT_decl_column : 7
    <423>   DW_AT_type        : <0x83>
    <427>   DW_AT_data_member_location: 76
 <2><428>: Abbrev Number: 11 (DW_TAG_member)
    <429>   DW_AT_name        : (indirect string, offset: 0x1e2): _offset
    <42d>   DW_AT_decl_file   : 5
    <42e>   DW_AT_decl_line   : 219
    <42f>   DW_AT_decl_column : 10
    <430>   DW_AT_type        : <0xa4>
    <434>   DW_AT_data_member_location: 80
 <2><435>: Abbrev Number: 11 (DW_TAG_member)
    <436>   DW_AT_name        : (indirect string, offset: 0x978): _data
    <43a>   DW_AT_decl_file   : 5
    <43b>   DW_AT_decl_line   : 222
    <43c>   DW_AT_decl_column : 18
    <43d>   DW_AT_type        : <0x488>
    <441>   DW_AT_data_member_location: 84
 <2><442>: Abbrev Number: 11 (DW_TAG_member)
    <443>   DW_AT_name        : (indirect string, offset: 0xba5): _lock
    <447>   DW_AT_decl_file   : 5
    <448>   DW_AT_decl_line   : 226
    <449>   DW_AT_decl_column : 12
    <44a>   DW_AT_type        : <0x137>
    <44e>   DW_AT_data_member_location: 88
 <2><44f>: Abbrev Number: 11 (DW_TAG_member)
    <450>   DW_AT_name        : (indirect string, offset: 0x391): _mbstate
    <454>   DW_AT_decl_file   : 5
    <455>   DW_AT_decl_line   : 228
    <456>   DW_AT_decl_column : 14
    <457>   DW_AT_type        : <0x12b>
    <45b>   DW_AT_data_member_location: 92
 <2><45c>: Abbrev Number: 11 (DW_TAG_member)
    <45d>   DW_AT_name        : (indirect string, offset: 0x2db): _flags2
    <461>   DW_AT_decl_file   : 5
    <462>   DW_AT_decl_line   : 229
    <463>   DW_AT_decl_column : 9
    <464>   DW_AT_type        : <0x83>
    <468>   DW_AT_data_member_location: 100
 <2><469>: Abbrev Number: 0
 <1><46a>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <46b>   DW_AT_prototyped  : 1
    <46b>   DW_AT_type        : <0xbc>
    <46f>   DW_AT_sibling     : <0x488>
 <2><473>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <474>   DW_AT_type        : <0x488>
 <2><478>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <479>   DW_AT_type        : <0x143>
 <2><47d>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <47e>   DW_AT_type        : <0x5dc>
 <2><482>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <483>   DW_AT_type        : <0x83>
 <2><487>: Abbrev Number: 0
 <1><488>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <489>   DW_AT_byte_size   : 4
    <48a>   DW_AT_type        : <0x493>
 <1><48e>: Abbrev Number: 21 (DW_TAG_const_type)
    <48f>   DW_AT_type        : <0x488>
 <1><493>: Abbrev Number: 22 (DW_TAG_structure_type)
    <494>   DW_AT_name        : (indirect string, offset: 0xae5): _reent
    <498>   DW_AT_byte_size   : 1064
    <49a>   DW_AT_decl_file   : 5
    <49b>   DW_AT_decl_line   : 569
    <49d>   DW_AT_decl_column : 8
    <49e>   DW_AT_sibling     : <0x5dc>
 <2><4a2>: Abbrev Number: 23 (DW_TAG_member)
    <4a3>   DW_AT_name        : (indirect string, offset: 0xe3b): _errno
    <4a7>   DW_AT_decl_file   : 5
    <4a8>   DW_AT_decl_line   : 571
    <4aa>   DW_AT_decl_column : 7
    <4ab>   DW_AT_type        : <0x83>
    <4af>   DW_AT_data_member_location: 0
 <2><4b0>: Abbrev Number: 23 (DW_TAG_member)
    <4b1>   DW_AT_name        : (indirect string, offset: 0x1c5): _stdin
    <4b5>   DW_AT_decl_file   : 5
    <4b6>   DW_AT_decl_line   : 576
    <4b8>   DW_AT_decl_column : 11
    <4b9>   DW_AT_type        : <0x6c8>
    <4bd>   DW_AT_data_member_location: 4
 <2><4be>: Abbrev Number: 23 (DW_TAG_member)
    <4bf>   DW_AT_name        : (indirect string, offset: 0x274): _stdout
    <4c3>   DW_AT_decl_file   : 5
    <4c4>   DW_AT_decl_line   : 576
    <4c6>   DW_AT_decl_column : 20
    <4c7>   DW_AT_type        : <0x6c8>
    <4cb>   DW_AT_data_member_location: 8
 <2><4cc>: Abbrev Number: 23 (DW_TAG_member)
    <4cd>   DW_AT_name        : (indirect string, offset: 0x233): _stderr
    <4d1>   DW_AT_decl_file   : 5
    <4d2>   DW_AT_decl_line   : 576
    <4d4>   DW_AT_decl_column : 30
    <4d5>   DW_AT_type        : <0x6c8>
    <4d9>   DW_AT_data_member_location: 12
 <2><4da>: Abbrev Number: 23 (DW_TAG_member)
    <4db>   DW_AT_name        : (indirect string, offset: 0x3b2): _inc
    <4df>   DW_AT_decl_file   : 5
    <4e0>   DW_AT_decl_line   : 578
    <4e2>   DW_AT_decl_column : 8
    <4e3>   DW_AT_type        : <0x83>
    <4e7>   DW_AT_data_member_location: 16
 <2><4e8>: Abbrev Number: 23 (DW_TAG_member)
    <4e9>   DW_AT_name        : (indirect string, offset: 0x95): _emergency
    <4ed>   DW_AT_decl_file   : 5
    <4ee>   DW_AT_decl_line   : 579
    <4f0>   DW_AT_decl_column : 8
    <4f1>   DW_AT_type        : <0x8c8>
    <4f5>   DW_AT_data_member_location: 20
 <2><4f6>: Abbrev Number: 23 (DW_TAG_member)
    <4f7>   DW_AT_name        : (indirect string, offset: 0x3ce): _unspecified_locale_info
    <4fb>   DW_AT_decl_file   : 5
    <4fc>   DW_AT_decl_line   : 582
    <4fe>   DW_AT_decl_column : 7
    <4ff>   DW_AT_type        : <0x83>
    <503>   DW_AT_data_member_location: 48
 <2><504>: Abbrev Number: 23 (DW_TAG_member)
    <505>   DW_AT_name        : (indirect string, offset: 0x3bc): _locale
    <509>   DW_AT_decl_file   : 5
    <50a>   DW_AT_decl_line   : 583
    <50c>   DW_AT_decl_column : 22
    <50d>   DW_AT_type        : <0x8dd>
    <511>   DW_AT_data_member_location: 52
 <2><512>: Abbrev Number: 23 (DW_TAG_member)
    <513>   DW_AT_name        : (indirect string, offset: 0x31f): __sdidinit
    <517>   DW_AT_decl_file   : 5
    <518>   DW_AT_decl_line   : 585
    <51a>   DW_AT_decl_column : 7
    <51b>   DW_AT_type        : <0x83>
    <51f>   DW_AT_data_member_location: 56
 <2><520>: Abbrev Number: 23 (DW_TAG_member)
    <521>   DW_AT_name        : (indirect string, offset: 0x3c4): __cleanup
    <525>   DW_AT_decl_file   : 5
    <526>   DW_AT_decl_line   : 587
    <528>   DW_AT_decl_column : 8
    <529>   DW_AT_type        : <0x8ee>
    <52d>   DW_AT_data_member_location: 60
 <2><52e>: Abbrev Number: 23 (DW_TAG_member)
    <52f>   DW_AT_name        : (indirect string, offset: 0x2c6): _result
    <533>   DW_AT_decl_file   : 5
    <534>   DW_AT_decl_line   : 590
    <536>   DW_AT_decl_column : 19
    <537>   DW_AT_type        : <0x1ab>
    <53b>   DW_AT_data_member_location: 64
 <2><53c>: Abbrev Number: 23 (DW_TAG_member)
    <53d>   DW_AT_name        : (indirect string, offset: 0x258): _result_k
    <541>   DW_AT_decl_file   : 5
    <542>   DW_AT_decl_line   : 591
    <544>   DW_AT_decl_column : 7
    <545>   DW_AT_type        : <0x83>
    <549>   DW_AT_data_member_location: 68
 <2><54a>: Abbrev Number: 23 (DW_TAG_member)
    <54b>   DW_AT_name        : (indirect string, offset: 0x51d): _p5s
    <54f>   DW_AT_decl_file   : 5
    <550>   DW_AT_decl_line   : 592
    <552>   DW_AT_decl_column : 19
    <553>   DW_AT_type        : <0x1ab>
    <557>   DW_AT_data_member_location: 72
 <2><558>: Abbrev Number: 23 (DW_TAG_member)
    <559>   DW_AT_name        : (indirect string, offset: 0x32a): _freelist
    <55d>   DW_AT_decl_file   : 5
    <55e>   DW_AT_decl_line   : 593
    <560>   DW_AT_decl_column : 20
    <561>   DW_AT_type        : <0x8f4>
    <565>   DW_AT_data_member_location: 76
 <2><566>: Abbrev Number: 23 (DW_TAG_member)
    <567>   DW_AT_name        : (indirect string, offset: 0x27c): _cvtlen
    <56b>   DW_AT_decl_file   : 5
    <56c>   DW_AT_decl_line   : 596
    <56e>   DW_AT_decl_column : 7
    <56f>   DW_AT_type        : <0x83>
    <573>   DW_AT_data_member_location: 80
 <2><574>: Abbrev Number: 23 (DW_TAG_member)
    <575>   DW_AT_name        : (indirect string, offset: 0x1da): _cvtbuf
    <579>   DW_AT_decl_file   : 5
    <57a>   DW_AT_decl_line   : 597
    <57c>   DW_AT_decl_column : 9
    <57d>   DW_AT_type        : <0x5dc>
    <581>   DW_AT_data_member_location: 84
 <2><582>: Abbrev Number: 23 (DW_TAG_member)
    <583>   DW_AT_name        : (indirect string, offset: 0x268): _new
    <587>   DW_AT_decl_file   : 5
    <588>   DW_AT_decl_line   : 632
    <58a>   DW_AT_decl_column : 7
    <58b>   DW_AT_type        : <0x8a3>
    <58f>   DW_AT_data_member_location: 88
 <2><590>: Abbrev Number: 24 (DW_TAG_member)
    <591>   DW_AT_name        : (indirect string, offset: 0x30d): _atexit
    <595>   DW_AT_decl_file   : 5
    <596>   DW_AT_decl_line   : 636
    <598>   DW_AT_decl_column : 19
    <599>   DW_AT_type        : <0x2dc>
    <59d>   DW_AT_data_member_location: 328
 <2><59f>: Abbrev Number: 24 (DW_TAG_member)
    <5a0>   DW_AT_name        : (indirect string, offset: 0x2a4): _atexit0
    <5a4>   DW_AT_decl_file   : 5
    <5a5>   DW_AT_decl_line   : 637
    <5a7>   DW_AT_decl_column : 18
    <5a8>   DW_AT_type        : <0x299>
    <5ac>   DW_AT_data_member_location: 332
 <2><5ae>: Abbrev Number: 24 (DW_TAG_member)
    <5af>   DW_AT_name        : (indirect string, offset: 0x4d1): _sig_func
    <5b3>   DW_AT_decl_file   : 5
    <5b4>   DW_AT_decl_line   : 641
    <5b6>   DW_AT_decl_column : 12
    <5b7>   DW_AT_type        : <0x905>
    <5bb>   DW_AT_data_member_location: 732
 <2><5bd>: Abbrev Number: 24 (DW_TAG_member)
    <5be>   DW_AT_name        : (indirect string, offset: 0x1ae): __sglue
    <5c2>   DW_AT_decl_file   : 5
    <5c3>   DW_AT_decl_line   : 646
    <5c5>   DW_AT_decl_column : 16
    <5c6>   DW_AT_type        : <0x689>
    <5ca>   DW_AT_data_member_location: 736
 <2><5cc>: Abbrev Number: 24 (DW_TAG_member)
    <5cd>   DW_AT_name        : (indirect string, offset: 0x193): __sf
    <5d1>   DW_AT_decl_file   : 5
    <5d2>   DW_AT_decl_line   : 648
    <5d4>   DW_AT_decl_column : 10
    <5d5>   DW_AT_type        : <0x911>
    <5d9>   DW_AT_data_member_location: 748
 <2><5db>: Abbrev Number: 0
 <1><5dc>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <5dd>   DW_AT_byte_size   : 4
    <5de>   DW_AT_type        : <0x5e2>
 <1><5e2>: Abbrev Number: 2 (DW_TAG_base_type)
    <5e3>   DW_AT_byte_size   : 1
    <5e4>   DW_AT_encoding    : 8	(unsigned char)
    <5e5>   DW_AT_name        : (indirect string, offset: 0x34f): char
 <1><5e9>: Abbrev Number: 21 (DW_TAG_const_type)
    <5ea>   DW_AT_type        : <0x5e2>
 <1><5ee>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <5ef>   DW_AT_byte_size   : 4
    <5f0>   DW_AT_type        : <0x46a>
 <1><5f4>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <5f5>   DW_AT_prototyped  : 1
    <5f5>   DW_AT_type        : <0xbc>
    <5f9>   DW_AT_sibling     : <0x612>
 <2><5fd>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <5fe>   DW_AT_type        : <0x488>
 <2><602>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <603>   DW_AT_type        : <0x143>
 <2><607>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <608>   DW_AT_type        : <0x612>
 <2><60c>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <60d>   DW_AT_type        : <0x83>
 <2><611>: Abbrev Number: 0
 <1><612>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <613>   DW_AT_byte_size   : 4
    <614>   DW_AT_type        : <0x5e9>
 <1><618>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <619>   DW_AT_byte_size   : 4
    <61a>   DW_AT_type        : <0x5f4>
 <1><61e>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <61f>   DW_AT_prototyped  : 1
    <61f>   DW_AT_type        : <0xb0>
    <623>   DW_AT_sibling     : <0x63c>
 <2><627>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <628>   DW_AT_type        : <0x488>
 <2><62c>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <62d>   DW_AT_type        : <0x143>
 <2><631>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <632>   DW_AT_type        : <0xb0>
 <2><636>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <637>   DW_AT_type        : <0x83>
 <2><63b>: Abbrev Number: 0
 <1><63c>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <63d>   DW_AT_byte_size   : 4
    <63e>   DW_AT_type        : <0x61e>
 <1><642>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <643>   DW_AT_prototyped  : 1
    <643>   DW_AT_type        : <0x83>
    <647>   DW_AT_sibling     : <0x656>
 <2><64b>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <64c>   DW_AT_type        : <0x488>
 <2><650>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <651>   DW_AT_type        : <0x143>
 <2><655>: Abbrev Number: 0
 <1><656>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <657>   DW_AT_byte_size   : 4
    <658>   DW_AT_type        : <0x642>
 <1><65c>: Abbrev Number: 8 (DW_TAG_array_type)
    <65d>   DW_AT_type        : <0x52>
    <661>   DW_AT_sibling     : <0x66c>
 <2><665>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <666>   DW_AT_type        : <0x8a>
    <66a>   DW_AT_upper_bound : 2
 <2><66b>: Abbrev Number: 0
 <1><66c>: Abbrev Number: 8 (DW_TAG_array_type)
    <66d>   DW_AT_type        : <0x52>
    <671>   DW_AT_sibling     : <0x67c>
 <2><675>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <676>   DW_AT_type        : <0x8a>
    <67a>   DW_AT_upper_bound : 0
 <2><67b>: Abbrev Number: 0
 <1><67c>: Abbrev Number: 5 (DW_TAG_typedef)
    <67d>   DW_AT_name        : (indirect string, offset: 0x377): __FILE
    <681>   DW_AT_decl_file   : 5
    <682>   DW_AT_decl_line   : 287
    <684>   DW_AT_decl_column : 26
    <685>   DW_AT_type        : <0x327>
 <1><689>: Abbrev Number: 25 (DW_TAG_structure_type)
    <68a>   DW_AT_name        : (indirect string, offset: 0xb24): _glue
    <68e>   DW_AT_byte_size   : 12
    <68f>   DW_AT_decl_file   : 5
    <690>   DW_AT_decl_line   : 291
    <692>   DW_AT_decl_column : 8
    <693>   DW_AT_sibling     : <0x6c2>
 <2><697>: Abbrev Number: 23 (DW_TAG_member)
    <698>   DW_AT_name        : (indirect string, offset: 0x39f): _next
    <69c>   DW_AT_decl_file   : 5
    <69d>   DW_AT_decl_line   : 293
    <69f>   DW_AT_decl_column : 17
    <6a0>   DW_AT_type        : <0x6c2>
    <6a4>   DW_AT_data_member_location: 0
 <2><6a5>: Abbrev Number: 23 (DW_TAG_member)
    <6a6>   DW_AT_name        : (indirect string, offset: 0x28a): _niobs
    <6aa>   DW_AT_decl_file   : 5
    <6ab>   DW_AT_decl_line   : 294
    <6ad>   DW_AT_decl_column : 7
    <6ae>   DW_AT_type        : <0x83>
    <6b2>   DW_AT_data_member_location: 4
 <2><6b3>: Abbrev Number: 23 (DW_TAG_member)
    <6b4>   DW_AT_name        : (indirect string, offset: 0x371): _iobs
    <6b8>   DW_AT_decl_file   : 5
    <6b9>   DW_AT_decl_line   : 295
    <6bb>   DW_AT_decl_column : 11
    <6bc>   DW_AT_type        : <0x6c8>
    <6c0>   DW_AT_data_member_location: 8
 <2><6c1>: Abbrev Number: 0
 <1><6c2>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <6c3>   DW_AT_byte_size   : 4
    <6c4>   DW_AT_type        : <0x689>
 <1><6c8>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <6c9>   DW_AT_byte_size   : 4
    <6ca>   DW_AT_type        : <0x67c>
 <1><6ce>: Abbrev Number: 25 (DW_TAG_structure_type)
    <6cf>   DW_AT_name        : (indirect string, offset: 0x8d): _rand48
    <6d3>   DW_AT_byte_size   : 14
    <6d4>   DW_AT_decl_file   : 5
    <6d5>   DW_AT_decl_line   : 319
    <6d7>   DW_AT_decl_column : 8
    <6d8>   DW_AT_sibling     : <0x707>
 <2><6dc>: Abbrev Number: 23 (DW_TAG_member)
    <6dd>   DW_AT_name        : (indirect string, offset: 0x3ef): _seed
    <6e1>   DW_AT_decl_file   : 5
    <6e2>   DW_AT_decl_line   : 320
    <6e4>   DW_AT_decl_column : 18
    <6e5>   DW_AT_type        : <0x707>
    <6e9>   DW_AT_data_member_location: 0
 <2><6ea>: Abbrev Number: 23 (DW_TAG_member)
    <6eb>   DW_AT_name        : (indirect string, offset: 0x423): _mult
    <6ef>   DW_AT_decl_file   : 5
    <6f0>   DW_AT_decl_line   : 321
    <6f2>   DW_AT_decl_column : 18
    <6f3>   DW_AT_type        : <0x707>
    <6f7>   DW_AT_data_member_location: 6
 <2><6f8>: Abbrev Number: 23 (DW_TAG_member)
    <6f9>   DW_AT_name        : (indirect string, offset: 0x43f): _add
    <6fd>   DW_AT_decl_file   : 5
    <6fe>   DW_AT_decl_line   : 322
    <700>   DW_AT_decl_column : 18
    <701>   DW_AT_type        : <0x60>
    <705>   DW_AT_data_member_location: 12
 <2><706>: Abbrev Number: 0
 <1><707>: Abbrev Number: 8 (DW_TAG_array_type)
    <708>   DW_AT_type        : <0x60>
    <70c>   DW_AT_sibling     : <0x717>
 <2><710>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <711>   DW_AT_type        : <0x8a>
    <715>   DW_AT_upper_bound : 2
 <2><716>: Abbrev Number: 0
 <1><717>: Abbrev Number: 26 (DW_TAG_structure_type)
    <718>   DW_AT_byte_size   : 208
    <719>   DW_AT_decl_file   : 5
    <71a>   DW_AT_decl_line   : 601
    <71c>   DW_AT_decl_column : 7
    <71d>   DW_AT_sibling     : <0x82c>
 <2><721>: Abbrev Number: 23 (DW_TAG_member)
    <722>   DW_AT_name        : (indirect string, offset: 0x48b): _unused_rand
    <726>   DW_AT_decl_file   : 5
    <727>   DW_AT_decl_line   : 603
    <729>   DW_AT_decl_column : 24
    <72a>   DW_AT_type        : <0x8a>
    <72e>   DW_AT_data_member_location: 0
 <2><72f>: Abbrev Number: 23 (DW_TAG_member)
    <730>   DW_AT_name        : (indirect string, offset: 0x429): _strtok_last
    <734>   DW_AT_decl_file   : 5
    <735>   DW_AT_decl_line   : 604
    <737>   DW_AT_decl_column : 18
    <738>   DW_AT_type        : <0x5dc>
    <73c>   DW_AT_data_member_location: 4
 <2><73d>: Abbrev Number: 23 (DW_TAG_member)
    <73e>   DW_AT_name        : (indirect string, offset: 0x2b9): _asctime_buf
    <742>   DW_AT_decl_file   : 5
    <743>   DW_AT_decl_line   : 605
    <745>   DW_AT_decl_column : 16
    <746>   DW_AT_type        : <0x82c>
    <74a>   DW_AT_data_member_location: 8
 <2><74b>: Abbrev Number: 23 (DW_TAG_member)
    <74c>   DW_AT_name        : (indirect string, offset: 0x4f4): _localtime_buf
    <750>   DW_AT_decl_file   : 5
    <751>   DW_AT_decl_line   : 606
    <753>   DW_AT_decl_column : 23
    <754>   DW_AT_type        : <0x1c1>
    <758>   DW_AT_data_member_location: 36
 <2><759>: Abbrev Number: 23 (DW_TAG_member)
    <75a>   DW_AT_name        : (indirect string, offset: 0x243): _gamma_signgam
    <75e>   DW_AT_decl_file   : 5
    <75f>   DW_AT_decl_line   : 607
    <761>   DW_AT_decl_column : 15
    <762>   DW_AT_type        : <0x83>
    <766>   DW_AT_data_member_location: 72
 <2><767>: Abbrev Number: 23 (DW_TAG_member)
    <768>   DW_AT_name        : (indirect string, offset: 0x39a): _rand_next
    <76c>   DW_AT_decl_file   : 5
    <76d>   DW_AT_decl_line   : 608
    <76f>   DW_AT_decl_column : 44
    <770>   DW_AT_type        : <0x7c>
    <774>   DW_AT_data_member_location: 80
 <2><775>: Abbrev Number: 23 (DW_TAG_member)
    <776>   DW_AT_name        : (indirect string, offset: 0x50a): _r48
    <77a>   DW_AT_decl_file   : 5
    <77b>   DW_AT_decl_line   : 609
    <77d>   DW_AT_decl_column : 26
    <77e>   DW_AT_type        : <0x6ce>
    <782>   DW_AT_data_member_location: 88
 <2><783>: Abbrev Number: 23 (DW_TAG_member)
    <784>   DW_AT_name        : (indirect string, offset: 0x3a5): _mblen_state
    <788>   DW_AT_decl_file   : 5
    <789>   DW_AT_decl_line   : 610
    <78b>   DW_AT_decl_column : 22
    <78c>   DW_AT_type        : <0x12b>
    <790>   DW_AT_data_member_location: 104
 <2><791>: Abbrev Number: 23 (DW_TAG_member)
    <792>   DW_AT_name        : (indirect string, offset: 0x50f): _mbtowc_state
    <796>   DW_AT_decl_file   : 5
    <797>   DW_AT_decl_line   : 611
    <799>   DW_AT_decl_column : 22
    <79a>   DW_AT_type        : <0x12b>
    <79e>   DW_AT_data_member_location: 112
 <2><79f>: Abbrev Number: 23 (DW_TAG_member)
    <7a0>   DW_AT_name        : (indirect string, offset: 0x14e): _wctomb_state
    <7a4>   DW_AT_decl_file   : 5
    <7a5>   DW_AT_decl_line   : 612
    <7a7>   DW_AT_decl_column : 22
    <7a8>   DW_AT_type        : <0x12b>
    <7ac>   DW_AT_data_member_location: 120
 <2><7ad>: Abbrev Number: 23 (DW_TAG_member)
    <7ae>   DW_AT_name        : (indirect string, offset: 0x4c7): _l64a_buf
    <7b2>   DW_AT_decl_file   : 5
    <7b3>   DW_AT_decl_line   : 613
    <7b5>   DW_AT_decl_column : 16
    <7b6>   DW_AT_type        : <0x83c>
    <7ba>   DW_AT_data_member_location: 128
 <2><7bb>: Abbrev Number: 23 (DW_TAG_member)
    <7bc>   DW_AT_name        : (indirect string, offset: 0x2ad): _signal_buf
    <7c0>   DW_AT_decl_file   : 5
    <7c1>   DW_AT_decl_line   : 614
    <7c3>   DW_AT_decl_column : 16
    <7c4>   DW_AT_type        : <0x84c>
    <7c8>   DW_AT_data_member_location: 136
 <2><7c9>: Abbrev Number: 23 (DW_TAG_member)
    <7ca>   DW_AT_name        : (indirect string, offset: 0x44c): _getdate_err
    <7ce>   DW_AT_decl_file   : 5
    <7cf>   DW_AT_decl_line   : 615
    <7d1>   DW_AT_decl_column : 15
    <7d2>   DW_AT_type        : <0x83>
    <7d6>   DW_AT_data_member_location: 160
 <2><7d7>: Abbrev Number: 23 (DW_TAG_member)
    <7d8>   DW_AT_name        : (indirect string, offset: 0x209): _mbrlen_state
    <7dc>   DW_AT_decl_file   : 5
    <7dd>   DW_AT_decl_line   : 616
    <7df>   DW_AT_decl_column : 22
    <7e0>   DW_AT_type        : <0x12b>
    <7e4>   DW_AT_data_member_location: 164
 <2><7e5>: Abbrev Number: 23 (DW_TAG_member)
    <7e6>   DW_AT_name        : (indirect string, offset: 0x13f): _mbrtowc_state
    <7ea>   DW_AT_decl_file   : 5
    <7eb>   DW_AT_decl_line   : 617
    <7ed>   DW_AT_decl_column : 22
    <7ee>   DW_AT_type        : <0x12b>
    <7f2>   DW_AT_data_member_location: 172
 <2><7f3>: Abbrev Number: 23 (DW_TAG_member)
    <7f4>   DW_AT_name        : (indirect string, offset: 0x1f8): _mbsrtowcs_state
    <7f8>   DW_AT_decl_file   : 5
    <7f9>   DW_AT_decl_line   : 618
    <7fb>   DW_AT_decl_column : 22
    <7fc>   DW_AT_type        : <0x12b>
    <800>   DW_AT_data_member_location: 180
 <2><801>: Abbrev Number: 23 (DW_TAG_member)
    <802>   DW_AT_name        : (indirect string, offset: 0xa0): _wcrtomb_state
    <806>   DW_AT_decl_file   : 5
    <807>   DW_AT_decl_line   : 619
    <809>   DW_AT_decl_column : 22
    <80a>   DW_AT_type        : <0x12b>
    <80e>   DW_AT_data_member_location: 188
 <2><80f>: Abbrev Number: 23 (DW_TAG_member)
    <810>   DW_AT_name        : (indirect string, offset: 0xaf): _wcsrtombs_state
    <814>   DW_AT_decl_file   : 5
    <815>   DW_AT_decl_line   : 620
    <817>   DW_AT_decl_column : 22
    <818>   DW_AT_type        : <0x12b>
    <81c>   DW_AT_data_member_location: 196
 <2><81d>: Abbrev Number: 23 (DW_TAG_member)
    <81e>   DW_AT_name        : (indirect string, offset: 0x354): _h_errno
    <822>   DW_AT_decl_file   : 5
    <823>   DW_AT_decl_line   : 621
    <825>   DW_AT_decl_column : 8
    <826>   DW_AT_type        : <0x83>
    <82a>   DW_AT_data_member_location: 204
 <2><82b>: Abbrev Number: 0
 <1><82c>: Abbrev Number: 8 (DW_TAG_array_type)
    <82d>   DW_AT_type        : <0x5e2>
    <831>   DW_AT_sibling     : <0x83c>
 <2><835>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <836>   DW_AT_type        : <0x8a>
    <83a>   DW_AT_upper_bound : 25
 <2><83b>: Abbrev Number: 0
 <1><83c>: Abbrev Number: 8 (DW_TAG_array_type)
    <83d>   DW_AT_type        : <0x5e2>
    <841>   DW_AT_sibling     : <0x84c>
 <2><845>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <846>   DW_AT_type        : <0x8a>
    <84a>   DW_AT_upper_bound : 7
 <2><84b>: Abbrev Number: 0
 <1><84c>: Abbrev Number: 8 (DW_TAG_array_type)
    <84d>   DW_AT_type        : <0x5e2>
    <851>   DW_AT_sibling     : <0x85c>
 <2><855>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <856>   DW_AT_type        : <0x8a>
    <85a>   DW_AT_upper_bound : 23
 <2><85b>: Abbrev Number: 0
 <1><85c>: Abbrev Number: 26 (DW_TAG_structure_type)
    <85d>   DW_AT_byte_size   : 240
    <85e>   DW_AT_decl_file   : 5
    <85f>   DW_AT_decl_line   : 626
    <861>   DW_AT_decl_column : 7
    <862>   DW_AT_sibling     : <0x883>
 <2><866>: Abbrev Number: 23 (DW_TAG_member)
    <867>   DW_AT_name        : (indirect string, offset: 0x2fd): _nextf
    <86b>   DW_AT_decl_file   : 5
    <86c>   DW_AT_decl_line   : 629
    <86e>   DW_AT_decl_column : 27
    <86f>   DW_AT_type        : <0x883>
    <873>   DW_AT_data_member_location: 0
 <2><874>: Abbrev Number: 23 (DW_TAG_member)
    <875>   DW_AT_name        : (indirect string, offset: 0x2f4): _nmalloc
    <879>   DW_AT_decl_file   : 5
    <87a>   DW_AT_decl_line   : 630
    <87c>   DW_AT_decl_column : 24
    <87d>   DW_AT_type        : <0x893>
    <881>   DW_AT_data_member_location: 120
 <2><882>: Abbrev Number: 0
 <1><883>: Abbrev Number: 8 (DW_TAG_array_type)
    <884>   DW_AT_type        : <0x321>
    <888>   DW_AT_sibling     : <0x893>
 <2><88c>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <88d>   DW_AT_type        : <0x8a>
    <891>   DW_AT_upper_bound : 29
 <2><892>: Abbrev Number: 0
 <1><893>: Abbrev Number: 8 (DW_TAG_array_type)
    <894>   DW_AT_type        : <0x8a>
    <898>   DW_AT_sibling     : <0x8a3>
 <2><89c>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <89d>   DW_AT_type        : <0x8a>
    <8a1>   DW_AT_upper_bound : 29
 <2><8a2>: Abbrev Number: 0
 <1><8a3>: Abbrev Number: 27 (DW_TAG_union_type)
    <8a4>   DW_AT_byte_size   : 240
    <8a5>   DW_AT_decl_file   : 5
    <8a6>   DW_AT_decl_line   : 599
    <8a8>   DW_AT_decl_column : 3
    <8a9>   DW_AT_sibling     : <0x8c8>
 <2><8ad>: Abbrev Number: 28 (DW_TAG_member)
    <8ae>   DW_AT_name        : (indirect string, offset: 0xae5): _reent
    <8b2>   DW_AT_decl_file   : 5
    <8b3>   DW_AT_decl_line   : 622
    <8b5>   DW_AT_decl_column : 11
    <8b6>   DW_AT_type        : <0x717>
 <2><8ba>: Abbrev Number: 28 (DW_TAG_member)
    <8bb>   DW_AT_name        : (indirect string, offset: 0x4e1): _unused
    <8bf>   DW_AT_decl_file   : 5
    <8c0>   DW_AT_decl_line   : 631
    <8c2>   DW_AT_decl_column : 11
    <8c3>   DW_AT_type        : <0x85c>
 <2><8c7>: Abbrev Number: 0
 <1><8c8>: Abbrev Number: 8 (DW_TAG_array_type)
    <8c9>   DW_AT_type        : <0x5e2>
    <8cd>   DW_AT_sibling     : <0x8d8>
 <2><8d1>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <8d2>   DW_AT_type        : <0x8a>
    <8d6>   DW_AT_upper_bound : 24
 <2><8d7>: Abbrev Number: 0
 <1><8d8>: Abbrev Number: 29 (DW_TAG_structure_type)
    <8d9>   DW_AT_name        : (indirect string, offset: 0xf4): __locale_t
    <8dd>   DW_AT_declaration : 1
 <1><8dd>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <8de>   DW_AT_byte_size   : 4
    <8df>   DW_AT_type        : <0x8d8>
 <1><8e3>: Abbrev Number: 30 (DW_TAG_subroutine_type)
    <8e4>   DW_AT_prototyped  : 1
    <8e4>   DW_AT_sibling     : <0x8ee>
 <2><8e8>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <8e9>   DW_AT_type        : <0x488>
 <2><8ed>: Abbrev Number: 0
 <1><8ee>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <8ef>   DW_AT_byte_size   : 4
    <8f0>   DW_AT_type        : <0x8e3>
 <1><8f4>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <8f5>   DW_AT_byte_size   : 4
    <8f6>   DW_AT_type        : <0x1ab>
 <1><8fa>: Abbrev Number: 30 (DW_TAG_subroutine_type)
    <8fb>   DW_AT_prototyped  : 1
    <8fb>   DW_AT_sibling     : <0x905>
 <2><8ff>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <900>   DW_AT_type        : <0x83>
 <2><904>: Abbrev Number: 0
 <1><905>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <906>   DW_AT_byte_size   : 4
    <907>   DW_AT_type        : <0x90b>
 <1><90b>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <90c>   DW_AT_byte_size   : 4
    <90d>   DW_AT_type        : <0x8fa>
 <1><911>: Abbrev Number: 8 (DW_TAG_array_type)
    <912>   DW_AT_type        : <0x67c>
    <916>   DW_AT_sibling     : <0x921>
 <2><91a>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <91b>   DW_AT_type        : <0x8a>
    <91f>   DW_AT_upper_bound : 2
 <2><920>: Abbrev Number: 0
 <1><921>: Abbrev Number: 31 (DW_TAG_variable)
    <922>   DW_AT_name        : (indirect string, offset: 0x471): _impure_ptr
    <926>   DW_AT_decl_file   : 5
    <927>   DW_AT_decl_line   : 775
    <929>   DW_AT_decl_column : 23
    <92a>   DW_AT_type        : <0x488>
    <92e>   DW_AT_external    : 1
    <92e>   DW_AT_declaration : 1
 <1><92e>: Abbrev Number: 31 (DW_TAG_variable)
    <92f>   DW_AT_name        : (indirect string, offset: 0x46a): _global_impure_ptr
    <933>   DW_AT_decl_file   : 5
    <934>   DW_AT_decl_line   : 776
    <936>   DW_AT_decl_column : 30
    <937>   DW_AT_type        : <0x48e>
    <93b>   DW_AT_external    : 1
    <93b>   DW_AT_declaration : 1
 <1><93b>: Abbrev Number: 32 (DW_TAG_variable)
    <93c>   DW_AT_name        : (indirect string, offset: 0x315): suboptarg
    <940>   DW_AT_decl_file   : 6
    <941>   DW_AT_decl_line   : 99
    <942>   DW_AT_decl_column : 14
    <943>   DW_AT_type        : <0x5dc>
    <947>   DW_AT_external    : 1
    <947>   DW_AT_declaration : 1
 <1><947>: Abbrev Number: 2 (DW_TAG_base_type)
    <948>   DW_AT_byte_size   : 4
    <949>   DW_AT_encoding    : 4	(float)
    <94a>   DW_AT_name        : (indirect string, offset: 0x1314): float
 <1><94e>: Abbrev Number: 2 (DW_TAG_base_type)
    <94f>   DW_AT_byte_size   : 8
    <950>   DW_AT_encoding    : 4	(float)
    <951>   DW_AT_name        : (indirect string, offset: 0x1266): double
 <1><955>: Abbrev Number: 33 (DW_TAG_enumeration_type)
    <956>   DW_AT_name        : (indirect string, offset: 0x459): __fdlibm_version
    <95a>   DW_AT_encoding    : 5	(signed)
    <95b>   DW_AT_byte_size   : 4
    <95c>   DW_AT_type        : <0x83>
    <960>   DW_AT_decl_file   : 7
    <961>   DW_AT_decl_line   : 642
    <963>   DW_AT_decl_column : 6
    <964>   DW_AT_sibling     : <0x981>
 <2><968>: Abbrev Number: 34 (DW_TAG_enumerator)
    <969>   DW_AT_name        : (indirect string, offset: 0x47d): __fdlibm_ieee
    <96d>   DW_AT_const_value : -1
 <2><96e>: Abbrev Number: 35 (DW_TAG_enumerator)
    <96f>   DW_AT_name        : (indirect string, offset: 0x1cc): __fdlibm_svid
    <973>   DW_AT_const_value : 0
 <2><974>: Abbrev Number: 35 (DW_TAG_enumerator)
    <975>   DW_AT_name        : (indirect string, offset: 0x130): __fdlibm_xopen
    <979>   DW_AT_const_value : 1
 <2><97a>: Abbrev Number: 35 (DW_TAG_enumerator)
    <97b>   DW_AT_name        : (indirect string, offset: 0xd7): __fdlibm_posix
    <97f>   DW_AT_const_value : 2
 <2><980>: Abbrev Number: 0
 <1><981>: Abbrev Number: 31 (DW_TAG_variable)
    <982>   DW_AT_name        : (indirect string, offset: 0x4ae): __fdlib_version
    <986>   DW_AT_decl_file   : 7
    <987>   DW_AT_decl_line   : 653
    <989>   DW_AT_decl_column : 35
    <98a>   DW_AT_type        : <0x955>
    <98e>   DW_AT_external    : 1
    <98e>   DW_AT_declaration : 1
 <1><98e>: Abbrev Number: 36 (DW_TAG_variable)
    <98f>   DW_AT_name        : (indirect string, offset: 0x4a7): cConst
    <993>   DW_AT_decl_file   : 1
    <994>   DW_AT_decl_line   : 8
    <995>   DW_AT_decl_column : 7
    <996>   DW_AT_type        : <0x947>
    <99a>   DW_AT_external    : 1
    <99a>   DW_AT_location    : 5 byte block: 3 6c a9 0 8 	(DW_OP_addr: 800a96c)
 <1><9a0>: Abbrev Number: 36 (DW_TAG_variable)
    <9a1>   DW_AT_name        : (indirect string, offset: 0x41c): bConst
    <9a5>   DW_AT_decl_file   : 1
    <9a6>   DW_AT_decl_line   : 9
    <9a7>   DW_AT_decl_column : 7
    <9a8>   DW_AT_type        : <0x947>
    <9ac>   DW_AT_external    : 1
    <9ac>   DW_AT_location    : 5 byte block: 3 70 a9 0 8 	(DW_OP_addr: 800a970)
 <1><9b2>: Abbrev Number: 37 (DW_TAG_subprogram)
    <9b3>   DW_AT_external    : 1
    <9b3>   DW_AT_name        : (indirect string, offset: 0x522): main
    <9b7>   DW_AT_decl_file   : 1
    <9b8>   DW_AT_decl_line   : 46
    <9b9>   DW_AT_decl_column : 5
    <9ba>   DW_AT_prototyped  : 1
    <9ba>   DW_AT_type        : <0x83>
    <9be>   DW_AT_low_pc      : 0x8004164
    <9c2>   DW_AT_high_pc     : 0x38
    <9c6>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <9c8>   DW_AT_GNU_all_tail_call_sites: 1
 <1><9c8>: Abbrev Number: 38 (DW_TAG_subprogram)
    <9c9>   DW_AT_external    : 1
    <9c9>   DW_AT_name        : (indirect string, offset: 0x1ea): newton_rapson
    <9cd>   DW_AT_decl_file   : 1
    <9ce>   DW_AT_decl_line   : 30
    <9cf>   DW_AT_decl_column : 6
    <9d0>   DW_AT_prototyped  : 1
    <9d0>   DW_AT_low_pc      : 0x8004124
    <9d4>   DW_AT_high_pc     : 0x40
    <9d8>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <9da>   DW_AT_GNU_all_tail_call_sites: 1
    <9da>   DW_AT_sibling     : <0x9fb>
 <2><9de>: Abbrev Number: 39 (DW_TAG_variable)
    <9df>   DW_AT_name        : x
    <9e1>   DW_AT_decl_file   : 1
    <9e2>   DW_AT_decl_line   : 31
    <9e3>   DW_AT_decl_column : 8
    <9e4>   DW_AT_type        : <0x947>
    <9e8>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><9eb>: Abbrev Number: 40 (DW_TAG_variable)
    <9ec>   DW_AT_name        : (indirect string, offset: 0x267): x_new
    <9f0>   DW_AT_decl_file   : 1
    <9f1>   DW_AT_decl_line   : 32
    <9f2>   DW_AT_decl_column : 8
    <9f3>   DW_AT_type        : <0x947>
    <9f7>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><9fa>: Abbrev Number: 0
 <1><9fb>: Abbrev Number: 41 (DW_TAG_subprogram)
    <9fc>   DW_AT_external    : 1
    <9fc>   DW_AT_name        : (indirect string, offset: 0x7c): percentage_error
    <a00>   DW_AT_decl_file   : 1
    <a01>   DW_AT_decl_line   : 21
    <a02>   DW_AT_decl_column : 7
    <a03>   DW_AT_prototyped  : 1
    <a03>   DW_AT_type        : <0x947>
    <a07>   DW_AT_low_pc      : 0x8004094
    <a0b>   DW_AT_high_pc     : 0x90
    <a0f>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a11>   DW_AT_GNU_all_tail_call_sites: 1
    <a11>   DW_AT_sibling     : <0xa4e>
 <2><a15>: Abbrev Number: 42 (DW_TAG_formal_parameter)
    <a16>   DW_AT_name        : x
    <a18>   DW_AT_decl_file   : 1
    <a19>   DW_AT_decl_line   : 21
    <a1a>   DW_AT_decl_column : 30
    <a1b>   DW_AT_type        : <0x947>
    <a1f>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><a22>: Abbrev Number: 42 (DW_TAG_formal_parameter)
    <a23>   DW_AT_name        : y
    <a25>   DW_AT_decl_file   : 1
    <a26>   DW_AT_decl_line   : 21
    <a27>   DW_AT_decl_column : 39
    <a28>   DW_AT_type        : <0x947>
    <a2c>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><a2f>: Abbrev Number: 40 (DW_TAG_variable)
    <a30>   DW_AT_name        : (indirect string, offset: 0xef): diff
    <a34>   DW_AT_decl_file   : 1
    <a35>   DW_AT_decl_line   : 25
    <a36>   DW_AT_decl_column : 8
    <a37>   DW_AT_type        : <0x947>
    <a3b>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><a3e>: Abbrev Number: 39 (DW_TAG_variable)
    <a3f>   DW_AT_name        : min
    <a43>   DW_AT_decl_file   : 1
    <a44>   DW_AT_decl_line   : 26
    <a45>   DW_AT_decl_column : 8
    <a46>   DW_AT_type        : <0x947>
    <a4a>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><a4d>: Abbrev Number: 0
 <1><a4e>: Abbrev Number: 43 (DW_TAG_subprogram)
    <a4f>   DW_AT_external    : 1
    <a4f>   DW_AT_name        : df
    <a52>   DW_AT_decl_file   : 1
    <a53>   DW_AT_decl_line   : 16
    <a54>   DW_AT_decl_column : 7
    <a55>   DW_AT_prototyped  : 1
    <a55>   DW_AT_type        : <0x947>
    <a59>   DW_AT_low_pc      : 0x8004064
    <a5d>   DW_AT_high_pc     : 0x30
    <a61>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a63>   DW_AT_GNU_all_call_sites: 1
    <a63>   DW_AT_sibling     : <0xa75>
 <2><a67>: Abbrev Number: 42 (DW_TAG_formal_parameter)
    <a68>   DW_AT_name        : x
    <a6a>   DW_AT_decl_file   : 1
    <a6b>   DW_AT_decl_line   : 16
    <a6c>   DW_AT_decl_column : 16
    <a6d>   DW_AT_type        : <0x947>
    <a71>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><a74>: Abbrev Number: 0
 <1><a75>: Abbrev Number: 44 (DW_TAG_subprogram)
    <a76>   DW_AT_external    : 1
    <a76>   DW_AT_name        : f
    <a78>   DW_AT_decl_file   : 1
    <a79>   DW_AT_decl_line   : 11
    <a7a>   DW_AT_decl_column : 7
    <a7b>   DW_AT_prototyped  : 1
    <a7b>   DW_AT_type        : <0x947>
    <a7f>   DW_AT_low_pc      : 0x800401c
    <a83>   DW_AT_high_pc     : 0x48
    <a87>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a89>   DW_AT_GNU_all_call_sites: 1
 <2><a89>: Abbrev Number: 42 (DW_TAG_formal_parameter)
    <a8a>   DW_AT_name        : x
    <a8c>   DW_AT_decl_file   : 1
    <a8d>   DW_AT_decl_line   : 11
    <a8e>   DW_AT_decl_column : 15
    <a8f>   DW_AT_type        : <0x947>
    <a93>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><a96>: Abbrev Number: 0
 <1><a97>: Abbrev Number: 0
  Compilation Unit @ offset 0xa98:
   Length:        0xe04 (32-bit)
   Version:       4
   Abbrev Offset: 0x2c6
   Pointer Size:  4
 <0><aa3>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <aa4>   DW_AT_producer    : (indirect string, offset: 0x5fa): GNU C17 8.2.0 -march=rv32ifd -mabi=ilp32d -g
    <aa8>   DW_AT_language    : 12	(ANSI C99)
    <aa9>   DW_AT_name        : (indirect string, offset: 0x582): /home/billtsou/Desktop/UPP/sunflower-simulator/tools/source/printf-4.0.0/printf.c
    <aad>   DW_AT_comp_dir    : (indirect string, offset: 0x66e): /home/billtsou/Desktop/UPP/sunflower-simulator/tools/objdir
    <ab1>   DW_AT_low_pc      : 0x800419c
    <ab5>   DW_AT_high_pc     : 0x24fc
    <ab9>   DW_AT_stmt_list   : 0x2e1
 <1><abd>: Abbrev Number: 2 (DW_TAG_base_type)
    <abe>   DW_AT_byte_size   : 1
    <abf>   DW_AT_encoding    : 6	(signed char)
    <ac0>   DW_AT_name        : (indirect string, offset: 0x348): signed char
 <1><ac4>: Abbrev Number: 2 (DW_TAG_base_type)
    <ac5>   DW_AT_byte_size   : 1
    <ac6>   DW_AT_encoding    : 8	(unsigned char)
    <ac7>   DW_AT_name        : (indirect string, offset: 0x346): unsigned char
 <1><acb>: Abbrev Number: 2 (DW_TAG_base_type)
    <acc>   DW_AT_byte_size   : 2
    <acd>   DW_AT_encoding    : 5	(signed)
    <ace>   DW_AT_name        : (indirect string, offset: 0x35d): short int
 <1><ad2>: Abbrev Number: 2 (DW_TAG_base_type)
    <ad3>   DW_AT_byte_size   : 2
    <ad4>   DW_AT_encoding    : 7	(unsigned)
    <ad5>   DW_AT_name        : (indirect string, offset: 0x291): short unsigned int
 <1><ad9>: Abbrev Number: 2 (DW_TAG_base_type)
    <ada>   DW_AT_byte_size   : 4
    <adb>   DW_AT_encoding    : 5	(signed)
    <adc>   DW_AT_name        : (indirect string, offset: 0x16a): long int
 <1><ae0>: Abbrev Number: 3 (DW_TAG_const_type)
    <ae1>   DW_AT_type        : <0xad9>
 <1><ae5>: Abbrev Number: 2 (DW_TAG_base_type)
    <ae6>   DW_AT_byte_size   : 4
    <ae7>   DW_AT_encoding    : 7	(unsigned)
    <ae8>   DW_AT_name        : (indirect string, offset: 0xc5): long unsigned int
 <1><aec>: Abbrev Number: 2 (DW_TAG_base_type)
    <aed>   DW_AT_byte_size   : 8
    <aee>   DW_AT_encoding    : 5	(signed)
    <aef>   DW_AT_name        : (indirect string, offset: 0x165): long long int
 <1><af3>: Abbrev Number: 3 (DW_TAG_const_type)
    <af4>   DW_AT_type        : <0xaec>
 <1><af8>: Abbrev Number: 4 (DW_TAG_typedef)
    <af9>   DW_AT_name        : (indirect string, offset: 0x6e2): __uint64_t
    <afd>   DW_AT_decl_file   : 2
    <afe>   DW_AT_decl_line   : 105
    <aff>   DW_AT_decl_column : 25
    <b00>   DW_AT_type        : <0xb04>
 <1><b04>: Abbrev Number: 2 (DW_TAG_base_type)
    <b05>   DW_AT_byte_size   : 8
    <b06>   DW_AT_encoding    : 7	(unsigned)
    <b07>   DW_AT_name        : (indirect string, offset: 0xc0): long long unsigned int
 <1><b0b>: Abbrev Number: 5 (DW_TAG_base_type)
    <b0c>   DW_AT_byte_size   : 4
    <b0d>   DW_AT_encoding    : 5	(signed)
    <b0e>   DW_AT_name        : int
 <1><b12>: Abbrev Number: 3 (DW_TAG_const_type)
    <b13>   DW_AT_type        : <0xb0b>
 <1><b17>: Abbrev Number: 4 (DW_TAG_typedef)
    <b18>   DW_AT_name        : (indirect string, offset: 0x70e): __uintptr_t
    <b1c>   DW_AT_decl_file   : 2
    <b1d>   DW_AT_decl_line   : 232
    <b1e>   DW_AT_decl_column : 26
    <b1f>   DW_AT_type        : <0xb23>
 <1><b23>: Abbrev Number: 2 (DW_TAG_base_type)
    <b24>   DW_AT_byte_size   : 4
    <b25>   DW_AT_encoding    : 7	(unsigned)
    <b26>   DW_AT_name        : (indirect string, offset: 0xca): unsigned int
 <1><b2a>: Abbrev Number: 3 (DW_TAG_const_type)
    <b2b>   DW_AT_type        : <0xb23>
 <1><b2f>: Abbrev Number: 4 (DW_TAG_typedef)
    <b30>   DW_AT_name        : (indirect string, offset: 0x6e4): uint64_t
    <b34>   DW_AT_decl_file   : 3
    <b35>   DW_AT_decl_line   : 60
    <b36>   DW_AT_decl_column : 20
    <b37>   DW_AT_type        : <0xaf8>
 <1><b3b>: Abbrev Number: 4 (DW_TAG_typedef)
    <b3c>   DW_AT_name        : (indirect string, offset: 0x710): uintptr_t
    <b40>   DW_AT_decl_file   : 3
    <b41>   DW_AT_decl_line   : 82
    <b42>   DW_AT_decl_column : 21
    <b43>   DW_AT_type        : <0xb17>
 <1><b47>: Abbrev Number: 4 (DW_TAG_typedef)
    <b48>   DW_AT_name        : (indirect string, offset: 0x74b): __gnuc_va_list
    <b4c>   DW_AT_decl_file   : 4
    <b4d>   DW_AT_decl_line   : 40
    <b4e>   DW_AT_decl_column : 27
    <b4f>   DW_AT_type        : <0xb53>
 <1><b53>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <b54>   DW_AT_byte_size   : 4
    <b55>   DW_AT_name        : (indirect string, offset: 0x6fc): __builtin_va_list
 <1><b59>: Abbrev Number: 4 (DW_TAG_typedef)
    <b5a>   DW_AT_name        : (indirect string, offset: 0x752): va_list
    <b5e>   DW_AT_decl_file   : 4
    <b5f>   DW_AT_decl_line   : 99
    <b60>   DW_AT_decl_column : 24
    <b61>   DW_AT_type        : <0xb47>
 <1><b65>: Abbrev Number: 4 (DW_TAG_typedef)
    <b66>   DW_AT_name        : (indirect string, offset: 0x10c7): size_t
    <b6a>   DW_AT_decl_file   : 5
    <b6b>   DW_AT_decl_line   : 216
    <b6c>   DW_AT_decl_column : 23
    <b6d>   DW_AT_type        : <0xb23>
 <1><b71>: Abbrev Number: 3 (DW_TAG_const_type)
    <b72>   DW_AT_type        : <0xb65>
 <1><b76>: Abbrev Number: 2 (DW_TAG_base_type)
    <b77>   DW_AT_byte_size   : 16
    <b78>   DW_AT_encoding    : 4	(float)
    <b79>   DW_AT_name        : (indirect string, offset: 0x1261): long double
 <1><b7d>: Abbrev Number: 4 (DW_TAG_typedef)
    <b7e>   DW_AT_name        : (indirect string, offset: 0x656): out_fct_type
    <b82>   DW_AT_decl_file   : 1
    <b83>   DW_AT_decl_line   : 122
    <b84>   DW_AT_decl_column : 16
    <b85>   DW_AT_type        : <0xb89>
 <1><b89>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b8a>   DW_AT_byte_size   : 4
    <b8b>   DW_AT_type        : <0xb8f>
 <1><b8f>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <b90>   DW_AT_prototyped  : 1
    <b90>   DW_AT_sibling     : <0xba9>
 <2><b94>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <b95>   DW_AT_type        : <0xba9>
 <2><b99>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <b9a>   DW_AT_type        : <0xbb5>
 <2><b9e>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <b9f>   DW_AT_type        : <0xb65>
 <2><ba3>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <ba4>   DW_AT_type        : <0xb65>
 <2><ba8>: Abbrev Number: 0
 <1><ba9>: Abbrev Number: 2 (DW_TAG_base_type)
    <baa>   DW_AT_byte_size   : 1
    <bab>   DW_AT_encoding    : 8	(unsigned char)
    <bac>   DW_AT_name        : (indirect string, offset: 0x34f): char
 <1><bb0>: Abbrev Number: 3 (DW_TAG_const_type)
    <bb1>   DW_AT_type        : <0xba9>
 <1><bb5>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <bb6>   DW_AT_byte_size   : 4
 <1><bb7>: Abbrev Number: 11 (DW_TAG_structure_type)
    <bb8>   DW_AT_byte_size   : 8
    <bb9>   DW_AT_decl_file   : 1
    <bba>   DW_AT_decl_line   : 126
    <bbb>   DW_AT_decl_column : 9
    <bbc>   DW_AT_sibling     : <0xbdb>
 <2><bc0>: Abbrev Number: 12 (DW_TAG_member)
    <bc1>   DW_AT_name        : fct
    <bc5>   DW_AT_decl_file   : 1
    <bc6>   DW_AT_decl_line   : 127
    <bc7>   DW_AT_decl_column : 11
    <bc8>   DW_AT_type        : <0xbeb>
    <bcc>   DW_AT_data_member_location: 0
 <2><bcd>: Abbrev Number: 12 (DW_TAG_member)
    <bce>   DW_AT_name        : arg
    <bd2>   DW_AT_decl_file   : 1
    <bd3>   DW_AT_decl_line   : 128
    <bd4>   DW_AT_decl_column : 9
    <bd5>   DW_AT_type        : <0xbb5>
    <bd9>   DW_AT_data_member_location: 4
 <2><bda>: Abbrev Number: 0
 <1><bdb>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <bdc>   DW_AT_prototyped  : 1
    <bdc>   DW_AT_sibling     : <0xbeb>
 <2><be0>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <be1>   DW_AT_type        : <0xba9>
 <2><be5>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <be6>   DW_AT_type        : <0xbb5>
 <2><bea>: Abbrev Number: 0
 <1><beb>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <bec>   DW_AT_byte_size   : 4
    <bed>   DW_AT_type        : <0xbdb>
 <1><bf1>: Abbrev Number: 4 (DW_TAG_typedef)
    <bf2>   DW_AT_name        : (indirect string, offset: 0x72d): out_fct_wrap_type
    <bf6>   DW_AT_decl_file   : 1
    <bf7>   DW_AT_decl_line   : 129
    <bf8>   DW_AT_decl_column : 3
    <bf9>   DW_AT_type        : <0xbb7>
 <1><bfd>: Abbrev Number: 3 (DW_TAG_const_type)
    <bfe>   DW_AT_type        : <0xbf1>
 <1><c02>: Abbrev Number: 13 (DW_TAG_subprogram)
    <c03>   DW_AT_external    : 1
    <c03>   DW_AT_name        : (indirect string, offset: 0x5e7): fctprintf
    <c07>   DW_AT_decl_file   : 1
    <c08>   DW_AT_decl_line   : 906
    <c0a>   DW_AT_decl_column : 5
    <c0b>   DW_AT_prototyped  : 1
    <c0b>   DW_AT_type        : <0xb0b>
    <c0f>   DW_AT_low_pc      : 0x8006610
    <c13>   DW_AT_high_pc     : 0x88
    <c17>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c19>   DW_AT_GNU_all_tail_call_sites: 1
    <c19>   DW_AT_sibling     : <0xc81>
 <2><c1d>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <c1e>   DW_AT_name        : out
    <c22>   DW_AT_decl_file   : 1
    <c23>   DW_AT_decl_line   : 906
    <c25>   DW_AT_decl_column : 22
    <c26>   DW_AT_type        : <0xbeb>
    <c2a>   DW_AT_location    : 3 byte block: 91 bc 7f 	(DW_OP_fbreg: -68)
 <2><c2e>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <c2f>   DW_AT_name        : arg
    <c33>   DW_AT_decl_file   : 1
    <c34>   DW_AT_decl_line   : 906
    <c36>   DW_AT_decl_column : 61
    <c37>   DW_AT_type        : <0xbb5>
    <c3b>   DW_AT_location    : 3 byte block: 91 b8 7f 	(DW_OP_fbreg: -72)
 <2><c3f>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <c40>   DW_AT_name        : (indirect string, offset: 0x62d): format
    <c44>   DW_AT_decl_file   : 1
    <c45>   DW_AT_decl_line   : 906
    <c47>   DW_AT_decl_column : 78
    <c48>   DW_AT_type        : <0xc81>
    <c4c>   DW_AT_location    : 3 byte block: 91 b4 7f 	(DW_OP_fbreg: -76)
 <2><c50>: Abbrev Number: 16 (DW_TAG_unspecified_parameters)
 <2><c51>: Abbrev Number: 17 (DW_TAG_variable)
    <c52>   DW_AT_name        : va
    <c55>   DW_AT_decl_file   : 1
    <c56>   DW_AT_decl_line   : 908
    <c58>   DW_AT_decl_column : 11
    <c59>   DW_AT_type        : <0xb59>
    <c5d>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <2><c60>: Abbrev Number: 18 (DW_TAG_variable)
    <c61>   DW_AT_name        : (indirect string, offset: 0x543): out_fct_wrap
    <c65>   DW_AT_decl_file   : 1
    <c66>   DW_AT_decl_line   : 910
    <c68>   DW_AT_decl_column : 27
    <c69>   DW_AT_type        : <0xbfd>
    <c6d>   DW_AT_location    : 2 byte block: 91 40 	(DW_OP_fbreg: -64)
 <2><c70>: Abbrev Number: 17 (DW_TAG_variable)
    <c71>   DW_AT_name        : ret
    <c75>   DW_AT_decl_file   : 1
    <c76>   DW_AT_decl_line   : 911
    <c78>   DW_AT_decl_column : 13
    <c79>   DW_AT_type        : <0xb12>
    <c7d>   DW_AT_location    : 2 byte block: 91 4c 	(DW_OP_fbreg: -52)
 <2><c80>: Abbrev Number: 0
 <1><c81>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <c82>   DW_AT_byte_size   : 4
    <c83>   DW_AT_type        : <0xbb0>
 <1><c87>: Abbrev Number: 13 (DW_TAG_subprogram)
    <c88>   DW_AT_external    : 1
    <c88>   DW_AT_name        : (indirect string, offset: 0x6aa): vsnprintf_
    <c8c>   DW_AT_decl_file   : 1
    <c8d>   DW_AT_decl_line   : 900
    <c8f>   DW_AT_decl_column : 5
    <c90>   DW_AT_prototyped  : 1
    <c90>   DW_AT_type        : <0xb0b>
    <c94>   DW_AT_low_pc      : 0x80065bc
    <c98>   DW_AT_high_pc     : 0x54
    <c9c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c9e>   DW_AT_GNU_all_tail_call_sites: 1
    <c9e>   DW_AT_sibling     : <0xce2>
 <2><ca2>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <ca3>   DW_AT_name        : (indirect string, offset: 0x555): buffer
    <ca7>   DW_AT_decl_file   : 1
    <ca8>   DW_AT_decl_line   : 900
    <caa>   DW_AT_decl_column : 22
    <cab>   DW_AT_type        : <0xce2>
    <caf>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><cb2>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <cb3>   DW_AT_name        : (indirect string, offset: 0x3f7): count
    <cb7>   DW_AT_decl_file   : 1
    <cb8>   DW_AT_decl_line   : 900
    <cba>   DW_AT_decl_column : 37
    <cbb>   DW_AT_type        : <0xb65>
    <cbf>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><cc2>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <cc3>   DW_AT_name        : (indirect string, offset: 0x62d): format
    <cc7>   DW_AT_decl_file   : 1
    <cc8>   DW_AT_decl_line   : 900
    <cca>   DW_AT_decl_column : 56
    <ccb>   DW_AT_type        : <0xc81>
    <ccf>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><cd2>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <cd3>   DW_AT_name        : va
    <cd6>   DW_AT_decl_file   : 1
    <cd7>   DW_AT_decl_line   : 900
    <cd9>   DW_AT_decl_column : 72
    <cda>   DW_AT_type        : <0xb59>
    <cde>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><ce1>: Abbrev Number: 0
 <1><ce2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <ce3>   DW_AT_byte_size   : 4
    <ce4>   DW_AT_type        : <0xba9>
 <1><ce8>: Abbrev Number: 13 (DW_TAG_subprogram)
    <ce9>   DW_AT_external    : 1
    <ce9>   DW_AT_name        : (indirect string, offset: 0x77a): vprintf_
    <ced>   DW_AT_decl_file   : 1
    <cee>   DW_AT_decl_line   : 893
    <cf0>   DW_AT_decl_column : 5
    <cf1>   DW_AT_prototyped  : 1
    <cf1>   DW_AT_type        : <0xb0b>
    <cf5>   DW_AT_low_pc      : 0x800656c
    <cf9>   DW_AT_high_pc     : 0x50
    <cfd>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <cff>   DW_AT_GNU_all_tail_call_sites: 1
    <cff>   DW_AT_sibling     : <0xd33>
 <2><d03>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <d04>   DW_AT_name        : (indirect string, offset: 0x62d): format
    <d08>   DW_AT_decl_file   : 1
    <d09>   DW_AT_decl_line   : 893
    <d0b>   DW_AT_decl_column : 26
    <d0c>   DW_AT_type        : <0xc81>
    <d10>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><d13>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <d14>   DW_AT_name        : va
    <d17>   DW_AT_decl_file   : 1
    <d18>   DW_AT_decl_line   : 893
    <d1a>   DW_AT_decl_column : 42
    <d1b>   DW_AT_type        : <0xb59>
    <d1f>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><d22>: Abbrev Number: 18 (DW_TAG_variable)
    <d23>   DW_AT_name        : (indirect string, offset: 0x555): buffer
    <d27>   DW_AT_decl_file   : 1
    <d28>   DW_AT_decl_line   : 895
    <d2a>   DW_AT_decl_column : 8
    <d2b>   DW_AT_type        : <0xd33>
    <d2f>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><d32>: Abbrev Number: 0
 <1><d33>: Abbrev Number: 19 (DW_TAG_array_type)
    <d34>   DW_AT_type        : <0xba9>
    <d38>   DW_AT_sibling     : <0xd43>
 <2><d3c>: Abbrev Number: 20 (DW_TAG_subrange_type)
    <d3d>   DW_AT_type        : <0xb23>
    <d41>   DW_AT_upper_bound : 0
 <2><d42>: Abbrev Number: 0
 <1><d43>: Abbrev Number: 13 (DW_TAG_subprogram)
    <d44>   DW_AT_external    : 1
    <d44>   DW_AT_name        : (indirect string, offset: 0x6ab): snprintf_
    <d48>   DW_AT_decl_file   : 1
    <d49>   DW_AT_decl_line   : 883
    <d4b>   DW_AT_decl_column : 5
    <d4c>   DW_AT_prototyped  : 1
    <d4c>   DW_AT_type        : <0xb0b>
    <d50>   DW_AT_low_pc      : 0x80064f4
    <d54>   DW_AT_high_pc     : 0x78
    <d58>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d5a>   DW_AT_GNU_all_tail_call_sites: 1
    <d5a>   DW_AT_sibling     : <0xdb2>
 <2><d5e>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <d5f>   DW_AT_name        : (indirect string, offset: 0x555): buffer
    <d63>   DW_AT_decl_file   : 1
    <d64>   DW_AT_decl_line   : 883
    <d66>   DW_AT_decl_column : 21
    <d67>   DW_AT_type        : <0xce2>
    <d6b>   DW_AT_location    : 3 byte block: 91 bc 7f 	(DW_OP_fbreg: -68)
 <2><d6f>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <d70>   DW_AT_name        : (indirect string, offset: 0x3f7): count
    <d74>   DW_AT_decl_file   : 1
    <d75>   DW_AT_decl_line   : 883
    <d77>   DW_AT_decl_column : 36
    <d78>   DW_AT_type        : <0xb65>
    <d7c>   DW_AT_location    : 3 byte block: 91 b8 7f 	(DW_OP_fbreg: -72)
 <2><d80>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <d81>   DW_AT_name        : (indirect string, offset: 0x62d): format
    <d85>   DW_AT_decl_file   : 1
    <d86>   DW_AT_decl_line   : 883
    <d88>   DW_AT_decl_column : 55
    <d89>   DW_AT_type        : <0xc81>
    <d8d>   DW_AT_location    : 3 byte block: 91 b4 7f 	(DW_OP_fbreg: -76)
 <2><d91>: Abbrev Number: 16 (DW_TAG_unspecified_parameters)
 <2><d92>: Abbrev Number: 17 (DW_TAG_variable)
    <d93>   DW_AT_name        : va
    <d96>   DW_AT_decl_file   : 1
    <d97>   DW_AT_decl_line   : 885
    <d99>   DW_AT_decl_column : 11
    <d9a>   DW_AT_type        : <0xb59>
    <d9e>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <2><da1>: Abbrev Number: 17 (DW_TAG_variable)
    <da2>   DW_AT_name        : ret
    <da6>   DW_AT_decl_file   : 1
    <da7>   DW_AT_decl_line   : 887
    <da9>   DW_AT_decl_column : 13
    <daa>   DW_AT_type        : <0xb12>
    <dae>   DW_AT_location    : 2 byte block: 91 4c 	(DW_OP_fbreg: -52)
 <2><db1>: Abbrev Number: 0
 <1><db2>: Abbrev Number: 13 (DW_TAG_subprogram)
    <db3>   DW_AT_external    : 1
    <db3>   DW_AT_name        : (indirect string, offset: 0x6d9): sprintf_
    <db7>   DW_AT_decl_file   : 1
    <db8>   DW_AT_decl_line   : 873
    <dba>   DW_AT_decl_column : 5
    <dbb>   DW_AT_prototyped  : 1
    <dbb>   DW_AT_type        : <0xb0b>
    <dbf>   DW_AT_low_pc      : 0x800647c
    <dc3>   DW_AT_high_pc     : 0x78
    <dc7>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <dc9>   DW_AT_GNU_all_tail_call_sites: 1
    <dc9>   DW_AT_sibling     : <0xe10>
 <2><dcd>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <dce>   DW_AT_name        : (indirect string, offset: 0x555): buffer
    <dd2>   DW_AT_decl_file   : 1
    <dd3>   DW_AT_decl_line   : 873
    <dd5>   DW_AT_decl_column : 20
    <dd6>   DW_AT_type        : <0xce2>
    <dda>   DW_AT_location    : 3 byte block: 91 bc 7f 	(DW_OP_fbreg: -68)
 <2><dde>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <ddf>   DW_AT_name        : (indirect string, offset: 0x62d): format
    <de3>   DW_AT_decl_file   : 1
    <de4>   DW_AT_decl_line   : 873
    <de6>   DW_AT_decl_column : 40
    <de7>   DW_AT_type        : <0xc81>
    <deb>   DW_AT_location    : 3 byte block: 91 b8 7f 	(DW_OP_fbreg: -72)
 <2><def>: Abbrev Number: 16 (DW_TAG_unspecified_parameters)
 <2><df0>: Abbrev Number: 17 (DW_TAG_variable)
    <df1>   DW_AT_name        : va
    <df4>   DW_AT_decl_file   : 1
    <df5>   DW_AT_decl_line   : 875
    <df7>   DW_AT_decl_column : 11
    <df8>   DW_AT_type        : <0xb59>
    <dfc>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <2><dff>: Abbrev Number: 17 (DW_TAG_variable)
    <e00>   DW_AT_name        : ret
    <e04>   DW_AT_decl_file   : 1
    <e05>   DW_AT_decl_line   : 877
    <e07>   DW_AT_decl_column : 13
    <e08>   DW_AT_type        : <0xb12>
    <e0c>   DW_AT_location    : 2 byte block: 91 4c 	(DW_OP_fbreg: -52)
 <2><e0f>: Abbrev Number: 0
 <1><e10>: Abbrev Number: 13 (DW_TAG_subprogram)
    <e11>   DW_AT_external    : 1
    <e11>   DW_AT_name        : (indirect string, offset: 0x6ad): printf_
    <e15>   DW_AT_decl_file   : 1
    <e16>   DW_AT_decl_line   : 862
    <e18>   DW_AT_decl_column : 5
    <e19>   DW_AT_prototyped  : 1
    <e19>   DW_AT_type        : <0xb0b>
    <e1d>   DW_AT_low_pc      : 0x8006404
    <e21>   DW_AT_high_pc     : 0x78
    <e25>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e27>   DW_AT_GNU_all_tail_call_sites: 1
    <e27>   DW_AT_sibling     : <0xe6d>
 <2><e2b>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <e2c>   DW_AT_name        : (indirect string, offset: 0x62d): format
    <e30>   DW_AT_decl_file   : 1
    <e31>   DW_AT_decl_line   : 862
    <e33>   DW_AT_decl_column : 25
    <e34>   DW_AT_type        : <0xc81>
    <e38>   DW_AT_location    : 3 byte block: 91 bc 7f 	(DW_OP_fbreg: -68)
 <2><e3c>: Abbrev Number: 16 (DW_TAG_unspecified_parameters)
 <2><e3d>: Abbrev Number: 17 (DW_TAG_variable)
    <e3e>   DW_AT_name        : va
    <e41>   DW_AT_decl_file   : 1
    <e42>   DW_AT_decl_line   : 864
    <e44>   DW_AT_decl_column : 11
    <e45>   DW_AT_type        : <0xb59>
    <e49>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <2><e4c>: Abbrev Number: 18 (DW_TAG_variable)
    <e4d>   DW_AT_name        : (indirect string, offset: 0x555): buffer
    <e51>   DW_AT_decl_file   : 1
    <e52>   DW_AT_decl_line   : 866
    <e54>   DW_AT_decl_column : 8
    <e55>   DW_AT_type        : <0xd33>
    <e59>   DW_AT_location    : 2 byte block: 91 44 	(DW_OP_fbreg: -60)
 <2><e5c>: Abbrev Number: 17 (DW_TAG_variable)
    <e5d>   DW_AT_name        : ret
    <e61>   DW_AT_decl_file   : 1
    <e62>   DW_AT_decl_line   : 867
    <e64>   DW_AT_decl_column : 13
    <e65>   DW_AT_type        : <0xb12>
    <e69>   DW_AT_location    : 2 byte block: 91 4c 	(DW_OP_fbreg: -52)
 <2><e6c>: Abbrev Number: 0
 <1><e6d>: Abbrev Number: 21 (DW_TAG_subprogram)
    <e6e>   DW_AT_name        : (indirect string, offset: 0x63a): _vsnprintf
    <e72>   DW_AT_decl_file   : 1
    <e73>   DW_AT_decl_line   : 577
    <e75>   DW_AT_decl_column : 12
    <e76>   DW_AT_prototyped  : 1
    <e76>   DW_AT_type        : <0xb0b>
    <e7a>   DW_AT_low_pc      : 0x8005658
    <e7e>   DW_AT_high_pc     : 0xdac
    <e82>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e84>   DW_AT_GNU_all_tail_call_sites: 1
    <e84>   DW_AT_sibling     : <0x1063>
 <2><e88>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <e89>   DW_AT_name        : out
    <e8d>   DW_AT_decl_file   : 1
    <e8e>   DW_AT_decl_line   : 577
    <e90>   DW_AT_decl_column : 36
    <e91>   DW_AT_type        : <0xb7d>
    <e95>   DW_AT_location    : 3 byte block: 91 fc 7e 	(DW_OP_fbreg: -132)
 <2><e99>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <e9a>   DW_AT_name        : (indirect string, offset: 0x555): buffer
    <e9e>   DW_AT_decl_file   : 1
    <e9f>   DW_AT_decl_line   : 577
    <ea1>   DW_AT_decl_column : 47
    <ea2>   DW_AT_type        : <0xce2>
    <ea6>   DW_AT_location    : 3 byte block: 91 f8 7e 	(DW_OP_fbreg: -136)
 <2><eaa>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <eab>   DW_AT_name        : (indirect string, offset: 0x6b5): maxlen
    <eaf>   DW_AT_decl_file   : 1
    <eb0>   DW_AT_decl_line   : 577
    <eb2>   DW_AT_decl_column : 68
    <eb3>   DW_AT_type        : <0xb71>
    <eb7>   DW_AT_location    : 3 byte block: 91 f4 7e 	(DW_OP_fbreg: -140)
 <2><ebb>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <ebc>   DW_AT_name        : (indirect string, offset: 0x62d): format
    <ec0>   DW_AT_decl_file   : 1
    <ec1>   DW_AT_decl_line   : 577
    <ec3>   DW_AT_decl_column : 88
    <ec4>   DW_AT_type        : <0xc81>
    <ec8>   DW_AT_location    : 3 byte block: 91 f0 7e 	(DW_OP_fbreg: -144)
 <2><ecc>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <ecd>   DW_AT_name        : va
    <ed0>   DW_AT_decl_file   : 1
    <ed1>   DW_AT_decl_line   : 577
    <ed3>   DW_AT_decl_column : 104
    <ed4>   DW_AT_type        : <0xb59>
    <ed8>   DW_AT_location    : 3 byte block: 91 ec 7e 	(DW_OP_fbreg: -148)
 <2><edc>: Abbrev Number: 18 (DW_TAG_variable)
    <edd>   DW_AT_name        : (indirect string, offset: 0x1b7): flags
    <ee1>   DW_AT_decl_file   : 1
    <ee2>   DW_AT_decl_line   : 579
    <ee4>   DW_AT_decl_column : 16
    <ee5>   DW_AT_type        : <0xb23>
    <ee9>   DW_AT_location    : 2 byte block: 91 4c 	(DW_OP_fbreg: -52)
 <2><eec>: Abbrev Number: 18 (DW_TAG_variable)
    <eed>   DW_AT_name        : (indirect string, offset: 0x745): width
    <ef1>   DW_AT_decl_file   : 1
    <ef2>   DW_AT_decl_line   : 579
    <ef4>   DW_AT_decl_column : 23
    <ef5>   DW_AT_type        : <0xb23>
    <ef9>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <2><efc>: Abbrev Number: 18 (DW_TAG_variable)
    <efd>   DW_AT_name        : (indirect string, offset: 0x770): precision
    <f01>   DW_AT_decl_file   : 1
    <f02>   DW_AT_decl_line   : 579
    <f04>   DW_AT_decl_column : 30
    <f05>   DW_AT_type        : <0xb23>
    <f09>   DW_AT_location    : 2 byte block: 91 44 	(DW_OP_fbreg: -60)
 <2><f0c>: Abbrev Number: 17 (DW_TAG_variable)
    <f0d>   DW_AT_name        : n
    <f0f>   DW_AT_decl_file   : 1
    <f10>   DW_AT_decl_line   : 579
    <f12>   DW_AT_decl_column : 41
    <f13>   DW_AT_type        : <0xb23>
    <f17>   DW_AT_location    : 2 byte block: 91 40 	(DW_OP_fbreg: -64)
 <2><f1a>: Abbrev Number: 17 (DW_TAG_variable)
    <f1b>   DW_AT_name        : idx
    <f1f>   DW_AT_decl_file   : 1
    <f20>   DW_AT_decl_line   : 580
    <f22>   DW_AT_decl_column : 10
    <f23>   DW_AT_type        : <0xb65>
    <f27>   DW_AT_location    : 3 byte block: 91 bc 7f 	(DW_OP_fbreg: -68)
 <2><f2b>: Abbrev Number: 22 (DW_TAG_lexical_block)
    <f2c>   DW_AT_low_pc      : 0x8005848
    <f30>   DW_AT_high_pc     : 0x4c
    <f34>   DW_AT_sibling     : <0xf48>
 <3><f38>: Abbrev Number: 17 (DW_TAG_variable)
    <f39>   DW_AT_name        : w
    <f3b>   DW_AT_decl_file   : 1
    <f3c>   DW_AT_decl_line   : 620
    <f3e>   DW_AT_decl_column : 17
    <f3f>   DW_AT_type        : <0xb12>
    <f43>   DW_AT_location    : 3 byte block: 91 a8 7f 	(DW_OP_fbreg: -88)
 <3><f47>: Abbrev Number: 0
 <2><f48>: Abbrev Number: 22 (DW_TAG_lexical_block)
    <f49>   DW_AT_low_pc      : 0x80058fc
    <f4d>   DW_AT_high_pc     : 0x30
    <f51>   DW_AT_sibling     : <0xf67>
 <3><f55>: Abbrev Number: 18 (DW_TAG_variable)
    <f56>   DW_AT_name        : (indirect string, offset: 0x73f): prec
    <f5a>   DW_AT_decl_file   : 1
    <f5b>   DW_AT_decl_line   : 640
    <f5d>   DW_AT_decl_column : 19
    <f5e>   DW_AT_type        : <0xb12>
    <f62>   DW_AT_location    : 3 byte block: 91 a4 7f 	(DW_OP_fbreg: -92)
 <3><f66>: Abbrev Number: 0
 <2><f67>: Abbrev Number: 22 (DW_TAG_lexical_block)
    <f68>   DW_AT_low_pc      : 0x8005a74
    <f6c>   DW_AT_high_pc     : 0x480
    <f70>   DW_AT_sibling     : <0xffe>
 <3><f74>: Abbrev Number: 18 (DW_TAG_variable)
    <f75>   DW_AT_name        : (indirect string, offset: 0xcdd): base
    <f79>   DW_AT_decl_file   : 1
    <f7a>   DW_AT_decl_line   : 692
    <f7c>   DW_AT_decl_column : 22
    <f7d>   DW_AT_type        : <0xb23>
    <f81>   DW_AT_location    : 3 byte block: 91 b8 7f 	(DW_OP_fbreg: -72)
 <3><f85>: Abbrev Number: 22 (DW_TAG_lexical_block)
    <f86>   DW_AT_low_pc      : 0x8005b78
    <f8a>   DW_AT_high_pc     : 0xc8
    <f8e>   DW_AT_sibling     : <0xfa4>
 <4><f92>: Abbrev Number: 18 (DW_TAG_variable)
    <f93>   DW_AT_name        : (indirect string, offset: 0x3ff): value
    <f97>   DW_AT_decl_file   : 1
    <f98>   DW_AT_decl_line   : 726
    <f9a>   DW_AT_decl_column : 29
    <f9b>   DW_AT_type        : <0xaf3>
    <f9f>   DW_AT_location    : 3 byte block: 91 98 7f 	(DW_OP_fbreg: -104)
 <4><fa3>: Abbrev Number: 0
 <3><fa4>: Abbrev Number: 22 (DW_TAG_lexical_block)
    <fa5>   DW_AT_low_pc      : 0x8005c50
    <fa9>   DW_AT_high_pc     : 0x70
    <fad>   DW_AT_sibling     : <0xfc3>
 <4><fb1>: Abbrev Number: 18 (DW_TAG_variable)
    <fb2>   DW_AT_name        : (indirect string, offset: 0x3ff): value
    <fb6>   DW_AT_decl_file   : 1
    <fb7>   DW_AT_decl_line   : 731
    <fb9>   DW_AT_decl_column : 24
    <fba>   DW_AT_type        : <0xae0>
    <fbe>   DW_AT_location    : 3 byte block: 91 94 7f 	(DW_OP_fbreg: -108)
 <4><fc2>: Abbrev Number: 0
 <3><fc3>: Abbrev Number: 22 (DW_TAG_lexical_block)
    <fc4>   DW_AT_low_pc      : 0x8005cc4
    <fc8>   DW_AT_high_pc     : 0xbc
    <fcc>   DW_AT_sibling     : <0xfe2>
 <4><fd0>: Abbrev Number: 18 (DW_TAG_variable)
    <fd1>   DW_AT_name        : (indirect string, offset: 0x3ff): value
    <fd5>   DW_AT_decl_file   : 1
    <fd6>   DW_AT_decl_line   : 735
    <fd8>   DW_AT_decl_column : 23
    <fd9>   DW_AT_type        : <0xb12>
    <fdd>   DW_AT_location    : 3 byte block: 91 90 7f 	(DW_OP_fbreg: -112)
 <4><fe1>: Abbrev Number: 0
 <3><fe2>: Abbrev Number: 23 (DW_TAG_lexical_block)
    <fe3>   DW_AT_low_pc      : 0x8005e4c
    <fe7>   DW_AT_high_pc     : 0x98
 <4><feb>: Abbrev Number: 18 (DW_TAG_variable)
    <fec>   DW_AT_name        : (indirect string, offset: 0x3ff): value
    <ff0>   DW_AT_decl_file   : 1
    <ff1>   DW_AT_decl_line   : 750
    <ff3>   DW_AT_decl_column : 32
    <ff4>   DW_AT_type        : <0xb2a>
    <ff8>   DW_AT_location    : 3 byte block: 91 a0 7f 	(DW_OP_fbreg: -96)
 <4><ffc>: Abbrev Number: 0
 <3><ffd>: Abbrev Number: 0
 <2><ffe>: Abbrev Number: 22 (DW_TAG_lexical_block)
    <fff>   DW_AT_low_pc      : 0x8006010
    <1003>   DW_AT_high_pc     : 0xdc
    <1007>   DW_AT_sibling     : <0x101b>
 <3><100b>: Abbrev Number: 17 (DW_TAG_variable)
    <100c>   DW_AT_name        : l
    <100e>   DW_AT_decl_file   : 1
    <100f>   DW_AT_decl_line   : 777
    <1011>   DW_AT_decl_column : 22
    <1012>   DW_AT_type        : <0xb23>
    <1016>   DW_AT_location    : 3 byte block: 91 b4 7f 	(DW_OP_fbreg: -76)
 <3><101a>: Abbrev Number: 0
 <2><101b>: Abbrev Number: 22 (DW_TAG_lexical_block)
    <101c>   DW_AT_low_pc      : 0x80060ec
    <1020>   DW_AT_high_pc     : 0x154
    <1024>   DW_AT_sibling     : <0x1047>
 <3><1028>: Abbrev Number: 17 (DW_TAG_variable)
    <1029>   DW_AT_name        : p
    <102b>   DW_AT_decl_file   : 1
    <102c>   DW_AT_decl_line   : 797
    <102e>   DW_AT_decl_column : 21
    <102f>   DW_AT_type        : <0xc81>
    <1033>   DW_AT_location    : 3 byte block: 91 b0 7f 	(DW_OP_fbreg: -80)
 <3><1037>: Abbrev Number: 17 (DW_TAG_variable)
    <1038>   DW_AT_name        : l
    <103a>   DW_AT_decl_file   : 1
    <103b>   DW_AT_decl_line   : 798
    <103d>   DW_AT_decl_column : 22
    <103e>   DW_AT_type        : <0xb23>
    <1042>   DW_AT_location    : 3 byte block: 91 ac 7f 	(DW_OP_fbreg: -84)
 <3><1046>: Abbrev Number: 0
 <2><1047>: Abbrev Number: 23 (DW_TAG_lexical_block)
    <1048>   DW_AT_low_pc      : 0x8006240
    <104c>   DW_AT_high_pc     : 0xd8
 <3><1050>: Abbrev Number: 18 (DW_TAG_variable)
    <1051>   DW_AT_name        : (indirect string, offset: 0x76a): is_ll
    <1055>   DW_AT_decl_file   : 1
    <1056>   DW_AT_decl_line   : 826
    <1058>   DW_AT_decl_column : 20
    <1059>   DW_AT_type        : <0x106a>
    <105d>   DW_AT_location    : 3 byte block: 91 8f 7f 	(DW_OP_fbreg: -113)
 <3><1061>: Abbrev Number: 0
 <2><1062>: Abbrev Number: 0
 <1><1063>: Abbrev Number: 2 (DW_TAG_base_type)
    <1064>   DW_AT_byte_size   : 1
    <1065>   DW_AT_encoding    : 2	(boolean)
    <1066>   DW_AT_name        : (indirect string, offset: 0x6d3): _Bool
 <1><106a>: Abbrev Number: 3 (DW_TAG_const_type)
    <106b>   DW_AT_type        : <0x1063>
 <1><106f>: Abbrev Number: 21 (DW_TAG_subprogram)
    <1070>   DW_AT_name        : (indirect string, offset: 0x565): _etoa
    <1074>   DW_AT_decl_file   : 1
    <1075>   DW_AT_decl_line   : 467
    <1077>   DW_AT_decl_column : 15
    <1078>   DW_AT_prototyped  : 1
    <1078>   DW_AT_type        : <0xb65>
    <107c>   DW_AT_low_pc      : 0x8005124
    <1080>   DW_AT_high_pc     : 0x534
    <1084>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1086>   DW_AT_GNU_all_tail_call_sites: 1
    <1086>   DW_AT_sibling     : <0x11c4>
 <2><108a>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <108b>   DW_AT_name        : out
    <108f>   DW_AT_decl_file   : 1
    <1090>   DW_AT_decl_line   : 467
    <1092>   DW_AT_decl_column : 34
    <1093>   DW_AT_type        : <0xb7d>
    <1097>   DW_AT_location    : 3 byte block: 91 9c 7f 	(DW_OP_fbreg: -100)
 <2><109b>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <109c>   DW_AT_name        : (indirect string, offset: 0x555): buffer
    <10a0>   DW_AT_decl_file   : 1
    <10a1>   DW_AT_decl_line   : 467
    <10a3>   DW_AT_decl_column : 45
    <10a4>   DW_AT_type        : <0xce2>
    <10a8>   DW_AT_location    : 3 byte block: 91 98 7f 	(DW_OP_fbreg: -104)
 <2><10ac>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <10ad>   DW_AT_name        : idx
    <10b1>   DW_AT_decl_file   : 1
    <10b2>   DW_AT_decl_line   : 467
    <10b4>   DW_AT_decl_column : 60
    <10b5>   DW_AT_type        : <0xb65>
    <10b9>   DW_AT_location    : 3 byte block: 91 94 7f 	(DW_OP_fbreg: -108)
 <2><10bd>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <10be>   DW_AT_name        : (indirect string, offset: 0x6b5): maxlen
    <10c2>   DW_AT_decl_file   : 1
    <10c3>   DW_AT_decl_line   : 467
    <10c5>   DW_AT_decl_column : 72
    <10c6>   DW_AT_type        : <0xb65>
    <10ca>   DW_AT_location    : 3 byte block: 91 90 7f 	(DW_OP_fbreg: -112)
 <2><10ce>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <10cf>   DW_AT_name        : (indirect string, offset: 0x3ff): value
    <10d3>   DW_AT_decl_file   : 1
    <10d4>   DW_AT_decl_line   : 467
    <10d6>   DW_AT_decl_column : 87
    <10d7>   DW_AT_type        : <0x11c4>
    <10db>   DW_AT_location    : 3 byte block: 91 88 7f 	(DW_OP_fbreg: -120)
 <2><10df>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <10e0>   DW_AT_name        : (indirect string, offset: 0x73f): prec
    <10e4>   DW_AT_decl_file   : 1
    <10e5>   DW_AT_decl_line   : 467
    <10e7>   DW_AT_decl_column : 107
    <10e8>   DW_AT_type        : <0xb23>
    <10ec>   DW_AT_location    : 3 byte block: 91 84 7f 	(DW_OP_fbreg: -124)
 <2><10f0>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <10f1>   DW_AT_name        : (indirect string, offset: 0x745): width
    <10f5>   DW_AT_decl_file   : 1
    <10f6>   DW_AT_decl_line   : 467
    <10f8>   DW_AT_decl_column : 126
    <10f9>   DW_AT_type        : <0xb23>
    <10fd>   DW_AT_location    : 3 byte block: 91 80 7f 	(DW_OP_fbreg: -128)
 <2><1101>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <1102>   DW_AT_name        : (indirect string, offset: 0x1b7): flags
    <1106>   DW_AT_decl_file   : 1
    <1107>   DW_AT_decl_line   : 467
    <1109>   DW_AT_decl_column : 146
    <110a>   DW_AT_type        : <0xb23>
    <110e>   DW_AT_location    : 3 byte block: 91 fc 7e 	(DW_OP_fbreg: -132)
 <2><1112>: Abbrev Number: 18 (DW_TAG_variable)
    <1113>   DW_AT_name        : (indirect string, offset: 0x5f1): negative
    <1117>   DW_AT_decl_file   : 1
    <1118>   DW_AT_decl_line   : 475
    <111a>   DW_AT_decl_column : 14
    <111b>   DW_AT_type        : <0x106a>
    <111f>   DW_AT_location    : 2 byte block: 91 53 	(DW_OP_fbreg: -45)
 <2><1122>: Abbrev Number: 24 (DW_TAG_union_type)
    <1123>   DW_AT_byte_size   : 8
    <1124>   DW_AT_decl_file   : 1
    <1125>   DW_AT_decl_line   : 487
    <1127>   DW_AT_decl_column : 3
    <1128>   DW_AT_sibling     : <0x1143>
 <3><112c>: Abbrev Number: 25 (DW_TAG_member)
    <112d>   DW_AT_name        : U
    <112f>   DW_AT_decl_file   : 1
    <1130>   DW_AT_decl_line   : 488
    <1132>   DW_AT_decl_column : 14
    <1133>   DW_AT_type        : <0xb2f>
 <3><1137>: Abbrev Number: 25 (DW_TAG_member)
    <1138>   DW_AT_name        : F
    <113a>   DW_AT_decl_file   : 1
    <113b>   DW_AT_decl_line   : 489
    <113d>   DW_AT_decl_column : 14
    <113e>   DW_AT_type        : <0x11c4>
 <3><1142>: Abbrev Number: 0
 <2><1143>: Abbrev Number: 18 (DW_TAG_variable)
    <1144>   DW_AT_name        : (indirect string, offset: 0x6f7): conv
    <1148>   DW_AT_decl_file   : 1
    <1149>   DW_AT_decl_line   : 490
    <114b>   DW_AT_decl_column : 5
    <114c>   DW_AT_type        : <0x1122>
    <1150>   DW_AT_location    : 3 byte block: 91 a8 7f 	(DW_OP_fbreg: -88)
 <2><1154>: Abbrev Number: 18 (DW_TAG_variable)
    <1155>   DW_AT_name        : (indirect string, offset: 0x53e): exp2
    <1159>   DW_AT_decl_file   : 1
    <115a>   DW_AT_decl_line   : 493
    <115c>   DW_AT_decl_column : 7
    <115d>   DW_AT_type        : <0xb0b>
    <1161>   DW_AT_location    : 2 byte block: 91 4c 	(DW_OP_fbreg: -52)
 <2><1164>: Abbrev Number: 18 (DW_TAG_variable)
    <1165>   DW_AT_name        : (indirect string, offset: 0x64f): expval
    <1169>   DW_AT_decl_file   : 1
    <116a>   DW_AT_decl_line   : 496
    <116c>   DW_AT_decl_column : 7
    <116d>   DW_AT_type        : <0xb0b>
    <1171>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><1174>: Abbrev Number: 17 (DW_TAG_variable)
    <1175>   DW_AT_name        : z
    <1177>   DW_AT_decl_file   : 1
    <1178>   DW_AT_decl_line   : 499
    <117a>   DW_AT_decl_column : 16
    <117b>   DW_AT_type        : <0x11cb>
    <117f>   DW_AT_location    : 2 byte block: 91 40 	(DW_OP_fbreg: -64)
 <2><1182>: Abbrev Number: 17 (DW_TAG_variable)
    <1183>   DW_AT_name        : z2
    <1186>   DW_AT_decl_file   : 1
    <1187>   DW_AT_decl_line   : 500
    <1189>   DW_AT_decl_column : 16
    <118a>   DW_AT_type        : <0x11cb>
    <118e>   DW_AT_location    : 3 byte block: 91 b8 7f 	(DW_OP_fbreg: -72)
 <2><1192>: Abbrev Number: 18 (DW_TAG_variable)
    <1193>   DW_AT_name        : (indirect string, offset: 0x55c): minwidth
    <1197>   DW_AT_decl_file   : 1
    <1198>   DW_AT_decl_line   : 511
    <119a>   DW_AT_decl_column : 16
    <119b>   DW_AT_type        : <0xb23>
    <119f>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><11a2>: Abbrev Number: 18 (DW_TAG_variable)
    <11a3>   DW_AT_name        : (indirect string, offset: 0x744): fwidth
    <11a7>   DW_AT_decl_file   : 1
    <11a8>   DW_AT_decl_line   : 537
    <11aa>   DW_AT_decl_column : 16
    <11ab>   DW_AT_type        : <0xb23>
    <11af>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><11b2>: Abbrev Number: 18 (DW_TAG_variable)
    <11b3>   DW_AT_name        : (indirect string, offset: 0x5dd): start_idx
    <11b7>   DW_AT_decl_file   : 1
    <11b8>   DW_AT_decl_line   : 556
    <11ba>   DW_AT_decl_column : 16
    <11bb>   DW_AT_type        : <0xb71>
    <11bf>   DW_AT_location    : 3 byte block: 91 b4 7f 	(DW_OP_fbreg: -76)
 <2><11c3>: Abbrev Number: 0
 <1><11c4>: Abbrev Number: 2 (DW_TAG_base_type)
    <11c5>   DW_AT_byte_size   : 8
    <11c6>   DW_AT_encoding    : 4	(float)
    <11c7>   DW_AT_name        : (indirect string, offset: 0x1266): double
 <1><11cb>: Abbrev Number: 3 (DW_TAG_const_type)
    <11cc>   DW_AT_type        : <0x11c4>
 <1><11d0>: Abbrev Number: 21 (DW_TAG_subprogram)
    <11d1>   DW_AT_name        : (indirect string, offset: 0x634): _ftoa
    <11d5>   DW_AT_decl_file   : 1
    <11d6>   DW_AT_decl_line   : 339
    <11d8>   DW_AT_decl_column : 15
    <11d9>   DW_AT_prototyped  : 1
    <11d9>   DW_AT_type        : <0xb65>
    <11dd>   DW_AT_low_pc      : 0x8004b2c
    <11e1>   DW_AT_high_pc     : 0x5f8
    <11e5>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <11e7>   DW_AT_GNU_all_tail_call_sites: 1
    <11e7>   DW_AT_sibling     : <0x1312>
 <2><11eb>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <11ec>   DW_AT_name        : out
    <11f0>   DW_AT_decl_file   : 1
